{"Discipline":{"name":"Discipline","background":"discipline","icon":"","talents":{"Unbreakable Will":{"name":"Unbreakable Will","pos":"a2","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your chance to resist Stun, Fear, and Silence effects by an additional 4%.","Increases your chance to resist Stun, Fear, and Silence effects by an additional 8%.","Increases your chance to resist Stun, Fear, and Silence effects by an additional 12%.","Increases your chance to resist Stun, Fear, and Silence effects by an additional 16%.","Increases your chance to resist Stun, Fear, and Silence effects by an additional 20%."]],"arrows":[],"icon":"spell_magic_magearmor"},"Divination":{"name":"Divination","pos":"a3","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your damage with Wands by 10%, grants 10% spellpower bonus to your wand attacks, and grants your Wand attacks a 20% chance to refresh the duration of your Holy Fire debuff on the target. ","Increases your damage with Wands by 20%, grants 20% spellpower bonus to your wand attacks, and grants your Wand attacks a 40% chance to refresh the duration of your Holy Fire debuff on the target. ","Increases your damage with Wands by 30%, grants 30% spellpower bonus to your wand attacks, and grants your Wand attacks a 60% chance to refresh the duration of your Holy Fire debuff on the target. ","Increases your damage with Wands by 40%, grants 40% spellpower bonus to your wand attacks, and grants your Wand attacks a 80% chance to refresh the duration of your Holy Fire debuff on the target. ","Increases your damage with Wands by 50%, grants 50% spellpower bonus to your wand attacks, and grants your Wand attacks a 100% chance to refresh the duration of your Holy Fire debuff on the target. "]],"arrows":[],"icon":"inv_wand_01"},"Faithfulness":{"name":"Faithfulness","pos":"b1","maxRank":3,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the cooldown of your Power Word: Shield by 1 sec.","Reduces the cooldown of your Power Word: Shield by 2 sec.","Reduces the cooldown of your Power Word: Shield by 3 sec."]],"arrows":[],"icon":"spell_holy_powerwordshield"},"Words of Power":{"name":"Words of Power","pos":"b2","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the effect and reduces the mana cost of your Power Word: Fortitude and Prayer of Fortitude spells by 25%.","Increases the effect and reduces the mana cost of your Power Word: Fortitude and Prayer of Fortitude spells by 50%."]],"arrows":[],"icon":"spell_holy_wordfortitude"},"Silent Resolve":{"name":"Silent Resolve","pos":"b3","maxRank":3,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the threat generated by your spells by 10%, and reduces the chance your spells are dispelled by 10%.","Reduces the threat generated by your spells by 20%, and reduces the chance your spells are dispelled by 20%.","Reduces the threat generated by your spells by 30%, and reduces the chance your spells are dispelled by 30%."]],"arrows":[],"icon":"spell_nature_manaregentotem"},"Fire Within":{"name":"Fire Within","pos":"b4","maxRank":5,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the Armor bonus of your Inner Fire spell by 20%, and increases the number of charges by 20.","Increases the Armor bonus of your Inner Fire spell by 40%, and increases the number of charges by 40.","Increases the Armor bonus of your Inner Fire spell by 60%, and increases the number of charges by 60.","Increases the Armor bonus of your Inner Fire spell by 80%, and increases the number of charges by 80.","Increases the Armor bonus of your Inner Fire spell by 100%, and increases the number of charges by 100."]],"arrows":[],"icon":"spell_holy_innerfire"},"Inner Focus":{"name":"Inner Focus","pos":"c2","maxRank":1,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"3 minutes cooldown","descriptions":[["When activated, reduces the Mana cost of your next spell by 100% and increases its critical effect chance by 25% if it is capable of a critical effect."]],"arrows":[],"icon":"spell_frost_windwalkon"},"Meditation":{"name":"Meditation","pos":"c3","maxRank":5,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Allows 10% of your Mana regeneration to continue while casting.","Allows 20% of your Mana regeneration to continue while casting.","Allows 30% of your Mana regeneration to continue while casting.","Allows 40% of your Mana regeneration to continue while casting.","Allows 50% of your Mana regeneration to continue while casting."]],"arrows":[],"icon":"spell_nature_sleep"},"Martyrdom":{"name":"Martyrdom","pos":"d1","maxRank":2,"reqPoints":15,"prereq":"Faithfulness","dependencyName":"","cost":"","cooldown":"","descriptions":[["Your Power Word: Shield grants the target 15% movement speed for 5 seconds.","Your Power Word: Shield grants the target 30% movement speed for 5 seconds."]],"arrows":[{"to":"d1","dir":"down","from":"b1"}],"icon":"spell_nature_tranquility"},"Mental Agility":{"name":"Mental Agility","pos":"d2","maxRank":5,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the mana cost of your instant cast spells by 3%, and grants 10% of your healing power as spell damage.","Reduces the mana cost of your instant cast spells by 6%, and grants 20% of your healing power as spell damage.","Reduces the mana cost of your instant cast spells by 9%, and grants 30% of your healing power as spell damage.","Reduces the mana cost of your instant cast spells by 12%, and grants 40% of your healing power as spell damage.","Reduces the mana cost of your instant cast spells by 15%, and grants 50% of your healing power as spell damage."]],"arrows":[],"icon":"ability_hibernation"},"Spiritual Domination":{"name":"Spiritual Domination","pos":"d4","maxRank":1,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the casting time of your Mana Burn spell by 1 second, and increases the effect of your Mana Burn, Divine Spirit, and Prayer of Spirit by 30%."]],"arrows":[],"icon":"spell_shadow_manaburn"},"Power Infusion":{"name":"Power Infusion","pos":"e2","maxRank":1,"reqPoints":20,"dependencyName":"","cost":"20% Base Mana","cooldown":"3 minutes cooldown","descriptions":[["Infuses the target with power, increasing their spell damage and healing by 20%.  Lasts 15 seconds."]],"arrows":[],"icon":"spell_holy_powerinfusion"},"Mental Strength":{"name":"Mental Strength","pos":"e3","maxRank":4,"reqPoints":20,"prereq":"Mental Agility","dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your maximum Mana by 5%.","Increases your maximum Mana by 10%.","Increases your maximum Mana by 15%.","Increases your maximum Mana by 20%."]],"arrows":[{"to":"d3","dir":"right-down","from":"d2"},{"to":"e3","dir":"right-down-down","from":"d3"}],"icon":"spell_nature_enchantarmor"},"Force of Will":{"name":"Force of Will","pos":"f3","maxRank":5,"reqPoints":25,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your spell damage by 1% and the critical strike chance of your offensive spells by 1%.","Increases your spell damage by 2% and the critical strike chance of your offensive spells by 2%.","Increases your spell damage by 3% and the critical strike chance of your offensive spells by 3%.","Increases your spell damage by 4% and the critical strike chance of your offensive spells by 4%.","Increases your spell damage by 5% and the critical strike chance of your offensive spells by 5%."]],"arrows":[],"icon":"spell_nature_slowingtotem"},"Penance":{"name":"Penance","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Power Infusion","dependencyName":"","cost":"20% Base Mana","cooldown":"10 seconds cooldown","descriptions":[["Launches a volley of holy light at the target, causing 115 damage to an enemy, or 115 healing to an ally instantly and every second for 2 seconds."]],"arrows":[{"to":"g2","dir":"down","from":"e2"}],"icon":"spell_holy_penance"},"Divine Aegis":{"name":"Divine Aegis","pos":"e1","maxRank":3,"reqPoints":20,"prereq":"Martyrdom","dependencyName":"","cost":"","cooldown":"","descriptions":[["Your critical heals with Flash Heal and Penance grant the target a Divine Aegis, absorbing 10% of the amount healed. Stacks up to 3 times.","Your critical heals with Flash Heal and Penance grant the target a Divine Aegis, absorbing 20% of the amount healed. Stacks up to 3 times.","Your critical heals with Flash Heal and Penance grant the target a Divine Aegis, absorbing 30% of the amount healed. Stacks up to 3 times."]],"arrows":[{"to":"e1","dir":"down","from":"d1"}],"icon":"spell_holy_devineaegis"}}}}