{"Shadow":{"name":"Shadow","background":"shadow","icon":"","talents":{"Spirit Tap":{"name":"Spirit Tap","pos":"a2","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives you a 20% chance to gain a 100% bonus to your Spirit after dealing the killing blow to a target.  For the duration, your Mana will regenerate at a 50% rate while casting.  Lasts 15 seconds.","Gives you a 40% chance to gain a 100% bonus to your Spirit after dealing the killing blow to a target.  For the duration, your Mana will regenerate at a 50% rate while casting.  Lasts 15 seconds.","Gives you a 60% chance to gain a 100% bonus to your Spirit after dealing the killing blow to a target.  For the duration, your Mana will regenerate at a 50% rate while casting.  Lasts 15 seconds.","Gives you a 80% chance to gain a 100% bonus to your Spirit after dealing the killing blow to a target.  For the duration, your Mana will regenerate at a 50% rate while casting.  Lasts 15 seconds.","Gives you a 100% chance to gain a 100% bonus to your Spirit after dealing the killing blow to a target.  For the duration, your Mana will regenerate at a 50% rate while casting.  Lasts 15 seconds."]],"arrows":[],"icon":"spell_shadow_requiem"},"Blackout":{"name":"Blackout","pos":"a3","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives your Shadow damage spells a 2% chance to stun the target for 3 seconds.","Gives your Shadow damage spells a 4% chance to stun the target for 3 seconds.","Gives your Shadow damage spells a 6% chance to stun the target for 3 seconds.","Gives your Shadow damage spells a 8% chance to stun the target for 3 seconds.","Gives your Shadow damage spells a 10% chance to stun the target for 3 seconds."]],"arrows":[],"icon":"spell_shadow_gathershadows"},"Shadow Affinity":{"name":"Shadow Affinity","pos":"b1","maxRank":3,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the threat generated by your Shadow spells by 8%.","Reduces the threat generated by your Shadow spells by 16%.","Reduces the threat generated by your Shadow spells by 25%."]],"arrows":[],"icon":"spell_shadow_shadowward"},"Pain & Suffering":{"name":"Pain & Suffering","pos":"b2","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the damage of your Shadow Word: Pain spell by 5%","Increases the damage of your Shadow Word: Pain spell by 10%"]],"arrows":[],"icon":"spell_shadow_shadowwordpain"},"Shadow Focus":{"name":"Shadow Focus","pos":"b3","maxRank":5,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces your target's chance to resist your Shadow spells by 2%.","Reduces your target's chance to resist your Shadow spells by 4%.","Reduces your target's chance to resist your Shadow spells by 6%.","Reduces your target's chance to resist your Shadow spells by 8%.","Reduces your target's chance to resist your Shadow spells by 10%."]],"arrows":[],"icon":"spell_shadow_burningspirit"},"Dark Whispers":{"name":"Dark Whispers","pos":"c1","maxRank":2,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the cooldown of your Psychic Scream spell by 2 sec., and increases the amount of targets affected by 5.","Reduces the cooldown of your Psychic Scream spell by 4 sec., and increases the amount of targets affected by 10."]],"arrows":[],"icon":"spell_shadow_psychicscream"},"Dementia":{"name":"Dementia","pos":"c2","maxRank":5,"reqPoints":10,"prereq":"Pain & Suffering","dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the cooldown of your Mind Blast spell by 0.5 sec., and grants your Mind Blast spell a 20% chance to refresh the duration of your Shadow Word: Pain on the target.","Reduces the cooldown of your Mind Blast spell by 1 sec., and grants your Mind Blast spell a 40% chance to refresh the duration of your Shadow Word: Pain on the target.","Reduces the cooldown of your Mind Blast spell by 1.5 sec., and grants your Mind Blast spell a 60% chance to refresh the duration of your Shadow Word: Pain on the target.","Reduces the cooldown of your Mind Blast spell by 2 sec., and grants your Mind Blast spell a 80% chance to refresh the duration of your Shadow Word: Pain on the target.","Reduces the cooldown of your Mind Blast spell by 2.5 sec., and grants your Mind Blast spell a 100% chance to refresh the duration of your Shadow Word: Pain on the target."]],"arrows":[{"to":"c2","dir":"down","from":"b2"}],"icon":"spell_shadow_unholyfrenzy"},"Mind Flay":{"name":"Mind Flay","pos":"c3","maxRank":1,"reqPoints":10,"dependencyName":"","cost":"45 Mana","cooldown":"","descriptions":[["Assault the target's mind with Shadow energy, causing 1 Shadow damage over 3 seconds and slowing their movement speed by 50%."]],"arrows":[],"icon":"spell_shadow_siphonmana"},"Fade to Black":{"name":"Fade to Black","pos":"d2","maxRank":2,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Decreases the cooldown of your Fade ability by 5 sec.","Decreases the cooldown of your Fade ability by 10 sec."]],"arrows":[],"icon":"spell_magic_lesserinvisibilty"},"Shadow Reach":{"name":"Shadow Reach","pos":"d3","maxRank":3,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the range of your Shadow damage spells by 6%.","Increases the range of your Shadow damage spells by 13%.","Increases the range of your Shadow damage spells by 20%."]],"arrows":[],"icon":"spell_shadow_chilltouch"},"Shadow Weaving":{"name":"Shadow Weaving","pos":"d4","maxRank":5,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Your Shadow damage spells have a 20% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 3% and lasts 15 seconds.  Stacks up to 5 times.","Your Shadow damage spells have a 40% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 3% and lasts 15 seconds.  Stacks up to 5 times.","Your Shadow damage spells have a 60% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 3% and lasts 15 seconds.  Stacks up to 5 times.","Your Shadow damage spells have a 80% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 3% and lasts 15 seconds.  Stacks up to 5 times.","Your Shadow damage spells have a 100% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 3% and lasts 15 seconds.  Stacks up to 5 times."]],"arrows":[],"icon":"spell_shadow_blackplague"},"Shadow Word: Silence":{"name":"Shadow Word: Silence","pos":"e1","maxRank":1,"reqPoints":20,"prereq":"Dark Whispers","dependencyName":"","cost":"225 Mana","cooldown":"30 seconds cooldown","descriptions":[["A single word of darkness silences the target, preventing spellcasting for 6 seconds."]],"arrows":[{"to":"e1","dir":"down","from":"c1"}],"icon":"spell_shadow_impphaseshift"},"Vampiric Embrace":{"name":"Vampiric Embrace","pos":"e2","maxRank":1,"reqPoints":20,"dependencyName":"","cost":"40 Mana","cooldown":"10 seconds cooldown","descriptions":[["Afflicts your target with Shadow energy that causes all nearby allies to be healed for 20% of any Shadow spell damage you deal for 1 minute. Can only affect one target at a time."]],"arrows":[],"icon":"spell_shadow_unsummonbuilding"},"Shadow Shock":{"name":"Shadow Shock","pos":"e3","maxRank":5,"reqPoints":20,"prereq":"Vampiric Embrace","dependencyName":"","cost":"","cooldown":"","descriptions":[["Causes 5% of shadow damage dealt to targets affected by Vampiric Embrace to damage all enemies within 10 yards of the afflicted target.","Causes 10% of shadow damage dealt to targets affected by Vampiric Embrace to damage all enemies within 10 yards of the afflicted target.","Causes 15% of shadow damage dealt to targets affected by Vampiric Embrace to damage all enemies within 10 yards of the afflicted target.","Causes 20% of shadow damage dealt to targets affected by Vampiric Embrace to damage all enemies within 10 yards of the afflicted target.","Causes 25% of shadow damage dealt to targets affected by Vampiric Embrace to damage all enemies within 10 yards of the afflicted target."]],"arrows":[{"to":"e3","dir":"right","from":"e2"}],"icon":"spell_shadow_improvedvampiricembrace"},"Darkness":{"name":"Darkness","pos":"f3","maxRank":5,"reqPoints":25,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your Shadow spell damage by 2%.","Increases your Shadow spell damage by 4%.","Increases your Shadow spell damage by 6%.","Increases your Shadow spell damage by 8%.","Increases your Shadow spell damage by 10%."]],"arrows":[],"icon":"spell_shadow_twilight"},"Shadowform":{"name":"Shadowform","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Vampiric Embrace","dependencyName":"","cost":"40% Base Mana","cooldown":"1.5 seconds cooldown","descriptions":[["Assume a Shadowform, increasing your Shadow damage by 15% and reducing Physical damage done to you by 15%.  However, you may not cast Holy spells while in this form."]],"arrows":[{"to":"g2","dir":"down","from":"e2"}],"icon":"spell_shadow_shadowform"}}}}