{"Shadow":{"name":"Shadow","background":"shadow","icon":"","talents":{"Shadow Affinity":{"name":"Shadow Affinity","pos":"a1","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Reduces the threat generated by your Shadow spells by 10%.","Reduces the threat generated by your Shadow spells by 20%.","Reduces the threat generated by your Shadow spells by 30%."],"icon":"spell_shadow_shadowward"},"Improved Shadow Word: Pain":{"name":"Improved Shadow Word: Pain","pos":"a2","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the duration of your Shadow Word: Pain spell by 3 sec and reduces it's Mana cost by 5%.","Increases the duration of your Shadow Word: Pain spell by 6 sec and reduces it's Mana cost by 10%."],"icon":"spell_shadow_shadowwordpain"},"Blackout":{"name":"Blackout","pos":"a3","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Gives your Shadow damage spells a 2% chance to stun the target for 2 seconds.","Gives your Shadow damage spells a 4% chance to stun the target for 2 seconds.","Gives your Shadow damage spells a 6% chance to stun the target for 2 seconds.","Gives your Shadow damage spells a 8% chance to stun the target for 2 seconds.","Gives your Shadow damage spells a 10% chance to stun the target for 2 seconds."],"icon":"spell_shadow_gathershadows"},"Improved Psychic Scream":{"name":"Improved Psychic Scream","pos":"c1","maxRank":2,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Psychic Scream spell by 15 sec and decreases an enemy's chance to resist it by 5%.","Reduces the cooldown of your Psychic Scream spell by 30 sec and decreases an enemy's chance to resist it by 10%."],"icon":"spell_shadow_psychicscream"},"Improved Mind Blast":{"name":"Improved Mind Blast","pos":"b2","maxRank":5,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Mind Blast spell by 1 sec.","Reduces the cooldown of your Mind Blast spell by 2 sec.","Reduces the cooldown of your Mind Blast spell by 3 sec.","Reduces the cooldown of your Mind Blast spell by 4 sec.","Reduces the cooldown of your Mind Blast spell by 5 sec."],"icon":"spell_shadow_unholyfrenzy"},"Shadow Focus":{"name":"Shadow Focus","pos":"b4","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces your target's chance to resist your Shadow spells by 2% and increases the range of your Shadow damage spells by 10%.","Reduces your target's chance to resist your Shadow spells by 4% and increases the range of your Shadow damage spells by 20%."],"icon":"spell_shadow_burningspirit"},"Improved Shadow Word: Silence":{"name":"Improved Shadow Word: Silence","pos":"d1","maxRank":2,"reqPoints":15,"prereq":"Improved Psychic Scream","cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Shadow Word: Silence spell by 15 sec.","Reduces the cooldown of your Shadow Word: Silence spell by 30 sec."],"icon":"spell_holy_silence"},"Mind Flay":{"name":"Mind Flay","pos":"c2","maxRank":1,"reqPoints":10,"cost":"55 Mana","cooldown":"","descriptions":["Assault the target's mind with Shadow energy, causing undefined1 Shadow damage over 5 seconds and slowing their movement speed by 50%."],"icon":"spell_shadow_siphonmana"},"Shadow Word: Numb":{"name":"Shadow Word: Numb","pos":"c3","maxRank":1,"reqPoints":10,"prereq":"Blackout","cost":"15% Base Mana","cooldown":"1 minute cooldown","descriptions":["A word of dark binding that strikes terror in the hearts, paralyzing target for 3 seconds."],"icon":"spell_shadow_nightofthedead"},"Improved Fade":{"name":"Improved Fade","pos":"c4","maxRank":2,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Decreases the cooldown of your Fade ability by 20 sec.","Decreases the cooldown of your Fade ability by 40 sec."],"icon":"spell_magic_lesserinvisibilty"},"Spirit Tap":{"name":"Spirit Tap","pos":"b1","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Gives you a 50% chance to gain a 100% bonus to your Spirit after killing a target that yields experience.  For the duration, your Mana will regenerate at a 50% rate while casting.  Lasts 15 seconds.","Gives you a 100% chance to gain a 100% bonus to your Spirit after killing a target that yields experience.  For the duration, your Mana will regenerate at a 50% rate while casting.  Lasts 15 seconds."],"icon":"spell_shadow_requiem"},"Improved Mind Flay":{"name":"Improved Mind Flay","pos":"d2","maxRank":3,"reqPoints":15,"prereq":"Mind Flay","cost":"","cooldown":"","descriptions":["Gives you a 30% chance to avoid interruption caused by damage while channeling the Mind Flay spell.","Gives you a 60% chance to avoid interruption caused by damage while channeling the Mind Flay spell.","Gives you a 90% chance to avoid interruption caused by damage while channeling the Mind Flay spell."],"icon":"spell_shadow_siphonmana"},"Darkness":{"name":"Darkness","pos":"d3","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases your Shadow damage by 2% and the effect of your Shadow Protection by 10%.","Increases your Shadow damage by 4% and the effect of your Shadow Protection by 20%.","Increases your Shadow damage by 6% and the effect of your Shadow Protection by 30%.","Increases your Shadow damage by 8% and the effect of your Shadow Protection by 40%.","Increases your Shadow damage by 10% and the effect of your Shadow Protection by 50%."],"icon":"spell_shadow_twilight"},"Burnt Soul":{"name":"Burnt Soul","pos":"e1","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Gives your casts a 10% chance to burn your soul, and to generate undefined1% of your total Mana over 9 seconds at the cost of undefined2% health.","Gives your casts a 20% chance to burn your soul, and to generate undefined1% of your total Mana over 9 seconds at the cost of undefined2% health.","Gives your casts a 30% chance to burn your soul, and to generate undefined1% of your total Mana over 9 seconds at the cost of undefined2% health."],"icon":"spell_shadow_shadowpower"},"Vampiric Embrace":{"name":"Vampiric Embrace","pos":"e2","maxRank":1,"reqPoints":20,"cost":"10% Base Mana","cooldown":"15 seconds cooldown","descriptions":["Afflicts your target with Shadow energy that causes all party members to be healed for 15% of any Shadow spell damage you deal for 1 minute."],"icon":"spell_shadow_unsummonbuilding"},"Blur":{"name":"Blur","pos":"e4","maxRank":3,"reqPoints":20,"prereq":"Improved Fade","cost":"","cooldown":"","descriptions":["The darkness envelopes you. You become untrackable and the chance you are hit by melee and ranged attacks reduced by 4%.","The darkness envelopes you. You become untrackable and the chance you are hit by melee and ranged attacks reduced by 7%.","The darkness envelopes you. You become untrackable and the chance you are hit by melee and ranged attacks reduced by 10%."],"icon":"ability_ambush"},"Mind Overlord":{"name":"Mind Overlord","pos":"f1","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Reduces the Mana cost of your Mind Blast, Mind Flay, Mind Control and Mind Vision spells by 6%.","Reduces the Mana cost of your Mind Blast, Mind Flay, Mind Control and Mind Vision spells by 12%.","Reduces the Mana cost of your Mind Blast, Mind Flay, Mind Control and Mind Vision spells by 18%.","Reduces the Mana cost of your Mind Blast, Mind Flay, Mind Control and Mind Vision spells by 24%.","Reduces the Mana cost of your Mind Blast, Mind Flay, Mind Control and Mind Vision spells by 30%."],"icon":"spell_nature_focusedmind"},"Improved Vampiric Embrace":{"name":"Improved Vampiric Embrace","pos":"f2","maxRank":2,"reqPoints":25,"prereq":"Vampiric Embrace","cost":"","cooldown":"","descriptions":["Increases the percentage healed by Vampiric Embrace by an additional 10%.","Increases the percentage healed by Vampiric Embrace by an additional 20%."],"icon":"spell_shadow_improvedvampiricembrace"},"Shadow Weaving":{"name":"Shadow Weaving","pos":"f3","maxRank":5,"reqPoints":25,"prereq":"Darkness","cost":"","cooldown":"","descriptions":["Your Shadow damage spells have a 20% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 2% and lasts 15 seconds.  Stacks up to undefined times.","Your Shadow damage spells have a 40% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 2% and lasts 15 seconds.  Stacks up to undefined times.","Your Shadow damage spells have a 60% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 2% and lasts 15 seconds.  Stacks up to undefined times.","Your Shadow damage spells have a 80% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 2% and lasts 15 seconds.  Stacks up to undefined times.","Your Shadow damage spells have a 100% chance to cause your target to be vulnerable to Shadow damage.  This vulnerability increases the Shadow damage dealt to your target by 2% and lasts 15 seconds.  Stacks up to undefined times."],"icon":"spell_shadow_blackplague"},"Shadowform":{"name":"Shadowform","pos":"g2","maxRank":1,"reqPoints":30,"cost":"","cooldown":"10 seconds cooldown","descriptions":["Assume a Shadowform, increasing your Shadow damage done and reducing your Shadow damage taken by 20%.  However, you may not cast Holy spells while in this form."],"icon":"spell_shadow_shadowform"}}}}