{"Balance":{"name":"Balance","background":"balance","icon":"","talents":{"Starlight Wrath":{"name":"Starlight Wrath","pos":"a1","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Reduces the cast time of your Wrath and Starfire spells by 0.1 sec.","Reduces the cast time of your Wrath and Starfire spells by 0.2 sec.","Reduces the cast time of your Wrath and Starfire spells by 0.3 sec.","Reduces the cast time of your Wrath and Starfire spells by 0.4 sec.","Reduces the cast time of your Wrath and Starfire spells by 0.5 sec."],"icon":"spell_nature_abolishmagic"},"Improved Moonfire":{"name":"Improved Moonfire","pos":"a2","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the critical strike chance of your Moonfire spell by 10%.","Increases the critical strike chance of your Moonfire spell by 20%.","Increases the critical strike chance of your Moonfire spell by 30%."],"icon":"spell_nature_starfall"},"Unity with Nature":{"name":"Unity with Nature","pos":"b3","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Barkskin by 1 min and reduces damage taken from Arcane and Nature effects by 5%.","Reduces the cooldown of your Barkskin by 2 min and reduces damage taken from Arcane and Nature effects by 10%.","Reduces the cooldown of your Barkskin by 3 min and reduces damage taken from Arcane and Nature effects by 15%."],"icon":"spell_nature_natureresistancetotem"},"Mighty Roots":{"name":"Mighty Roots","pos":"b1","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the duration and damage of your Entangling Roots and Thorns spells by 40%.","Increases the duration and damage of your Entangling Roots and Thorns spells by 70%.","Increases the duration and damage of your Entangling Roots and Thorns spells by 100%."],"icon":"spell_nature_thorns"},"Natural Weapons":{"name":"Natural Weapons","pos":"b2","maxRank":5,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the damage you deal with all attacks and spells by 1%.","Increases the damage you deal with all attacks and spells by 2%.","Increases the damage you deal with all attacks and spells by 3%.","Increases the damage you deal with all attacks and spells by 4%.","Increases the damage you deal with all attacks and spells by 5%."],"icon":"inv_staff_01"},"Cycle of Life":{"name":"Cycle of Life","pos":"a3","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Gives you a 50% chance to gain a 100% bonus to your Spirit after killing a target that yields experience. This effect also allows 50% of your Mana Regeneration to continue while casting.  Lasts 15 seconds.","Gives you a 100% chance to gain a 100% bonus to your Spirit after killing a target that yields experience. This effect also allows 50% of your Mana Regeneration to continue while casting.  Lasts 15 seconds."],"icon":"banish_2"},"Improved Faerie Fire":{"name":"Improved Faerie Fire","pos":"c1","maxRank":3,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the range and armor reduction of your Faerie Fire and Faerie Fire (Feral) spells by 10%.","Increases the range and armor reduction of your Faerie Fire and Faerie Fire (Feral) spells by 20%.","Increases the range and armor reduction of your Faerie Fire and Faerie Fire (Feral) spells by 30%."],"icon":"spell_nature_faeriefire"},"Hurricane":{"name":"Hurricane","pos":"c3","maxRank":1,"reqPoints":10,"cost":"500 Mana","cooldown":"2 minutes cooldown","descriptions":["Creates a violent storm in the target area causing 22 Nature damage to enemies every 1 sec, slowing their movement speed by 50% and silencing them.  Lasts 10 seconds."],"icon":"spell_nature_cyclone"},"Starfall":{"name":"Starfall","pos":"c4","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Cause your Starfire and Moonfire spells to stun the target for 4 seconds if the target is within 8 yds. Can occur only once per 1 minute.","Cause your Starfire and Moonfire spells to stun the target for 4 seconds if the target is within 8 yds. Can occur only once per 55 seconds.","Cause your Starfire and Moonfire spells to stun the target for 4 seconds if the target is within 8 yds. Can occur only once per 50 seconds.","Cause your Starfire and Moonfire spells to stun the target for 4 seconds if the target is within 8 yds. Can occur only once per 45 seconds.","Cause your Starfire and Moonfire spells to stun the target for 4 seconds if the target is within 8 yds. Can occur only once per 40 seconds."],"icon":"spell_arcane_starfire"},"Omnipresence":{"name":"Omnipresence","pos":"d1","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the range of your offensive Balance spells by 10% and reduces the chance enemies will resist them by 2%.","Increases the range of your offensive Balance spells by 20% and reduces the chance enemies will resist them by 4%."],"icon":"spell_nature_naturetouchgrow"},"Vengeance":{"name":"Vengeance","pos":"d2","maxRank":5,"reqPoints":15,"prereq":"Natural Weapons","cost":"","cooldown":"","descriptions":["Increases the critical strike damage bonus of your offensive spells by 20% and for your feral abilities by 10%.","Increases the critical strike damage bonus of your offensive spells by 40% and for your feral abilities by 20%.","Increases the critical strike damage bonus of your offensive spells by 60% and for your feral abilities by 30%.","Increases the critical strike damage bonus of your offensive spells by 80% and for your feral abilities by 40%.","Increases the critical strike damage bonus of your offensive spells by 100% and for your feral abilities by 50%."],"icon":"spell_nature_purge"},"Power of Nature":{"name":"Power of Nature","pos":"d3","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the duration of your Barkskin, Nature's Grasp, Moonfire, Insect Swarm, Faerie Fire, Rejuvenation, Regrowth, Hibernate, Soothe Animal and Abolish Poison by 25%. \nIn adition, increases the number of charges of your Nature's Grasp spell by 2.","Increases the duration of your Barkskin, Nature's Grasp, Moonfire, Insect Swarm, Faerie Fire, Rejuvenation, Regrowth, Hibernate, Soothe Animal and Abolish Poison by 50%. \nIn adition, increases the number of charges of your Nature's Grasp spell by 4."],"icon":"spell_nature_rockbiter"},"Dreamstate":{"name":"Dreamstate","pos":"e1","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Regenerates 1% of your total Mana every 1 seconds.","Regenerates 2% of your total Mana every 1 seconds.","Regenerates 3% of your total Mana every 1 seconds."],"icon":"ability_druid_dreamstate"},"Moonkin Form":{"name":"Moonkin Form","pos":"e2","maxRank":1,"reqPoints":20,"cost":"20% Base Mana","cooldown":"","descriptions":["Transforms the Druid into Moonkin Form, increasing spell critical chance by 2%, Arcane and Nature resistances by 1 per level and armor contribution from items by 180%. The Moonkin can only cast Balance spells while shapeshifted.\n\nThe act of shapeshifting frees the caster of Polymorph and Movement Impairing effects."],"icon":"spell_nature_forceofnature"},"Nature's Grace":{"name":"Nature's Grace","pos":"e3","maxRank":1,"reqPoints":20,"cost":"","cooldown":"","descriptions":["All spell criticals grace you with a blessing of nature, reducing the casting time of your next spell by 0.5 sec."],"icon":"spell_nature_naturesblessing"},"Moonglow":{"name":"Moonglow","pos":"e4","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Reduces the Mana cost of your Moonfire, Starfire, Wrath, Healing Touch, Regrowth and Rejuvenation spells by 5%.","Reduces the Mana cost of your Moonfire, Starfire, Wrath, Healing Touch, Regrowth and Rejuvenation spells by 10%.","Reduces the Mana cost of your Moonfire, Starfire, Wrath, Healing Touch, Regrowth and Rejuvenation spells by 15%."],"icon":"spell_nature_sentinal"},"Moonfury":{"name":"Moonfury","pos":"f1","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Increases the damage done by your Arcane spells by 3%.","Increases the damage done by your Arcane spells by 6%.","Increases the damage done by your Arcane spells by 9%.","Increases the damage done by your Arcane spells by 12%.","Increases the damage done by your Arcane spells by 15%."],"icon":"moonstone"},"Nature Balancer":{"name":"Nature Balancer","pos":"f3","maxRank":5,"reqPoints":25,"prereq":"Nature's Grace","cost":"","cooldown":"","descriptions":["Your Wrath spell have a 4% chance to increase critical strike chance of your next Moonfire or Starfire by 50%, and your Moonfire or Starfire spells have a 4% chance to increase critical strike chance of your next Wrath by 50%.","Your Wrath spell have a 8% chance to increase critical strike chance of your next Moonfire or Starfire by 50%, and your Moonfire or Starfire spells have a 8% chance to increase critical strike chance of your next Wrath by 50%.","Your Wrath spell have a 12% chance to increase critical strike chance of your next Moonfire or Starfire by 50%, and your Moonfire or Starfire spells have a 12% chance to increase critical strike chance of your next Wrath by 50%.","Your Wrath spell have a 16% chance to increase critical strike chance of your next Moonfire or Starfire by 50%, and your Moonfire or Starfire spells have a 16% chance to increase critical strike chance of your next Wrath by 50%.","Your Wrath spell have a 20% chance to increase critical strike chance of your next Moonfire or Starfire by 50%, and your Moonfire or Starfire spells have a 20% chance to increase critical strike chance of your next Wrath by 50%."],"icon":"ability_druid_balanceofpower"},"Moonkin Aura":{"name":"Moonkin Aura","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Moonkin Form","cost":"","cooldown":"","descriptions":["While in Moonkin Form, the Moonkin Aura increases spell critical chance of all raid members within 20 yards by 3%."],"icon":"spell_nature_moonglow"}}}}