{"Feral":{"name":"Feral","background":"feral","icon":"","talents":{"Ferocity":{"name":"Ferocity","pos":"a1","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 1 Rage or Energy.","Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 2 Rage or Energy.","Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 3 Rage or Energy.","Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 4 Rage or Energy.","Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 5 Rage or Energy."]],"arrows":[],"icon":"ability_hunter_pet_hyena"},"Feral Aggression":{"name":"Feral Aggression","pos":"a2","maxRank":2,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the effectiveness of your Demoralizing Roar by 20% and the damage caused by your Ferocious Bite and Rip by 5%.","Increases the effectiveness of your Demoralizing Roar by 40% and the damage caused by your Ferocious Bite and Rip by 10%."]],"arrows":[],"icon":"ability_druid_demoralizingroar"},"Thick Hide":{"name":"Thick Hide","pos":"a3","maxRank":3,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your Armor contribution from items by 5%.","Increases your Armor contribution from items by 10%.","Increases your Armor contribution from items by 15%."]],"arrows":[],"icon":"inv_misc_pelt_bear_03"},"Primal Tenacity":{"name":"Primal Tenacity","pos":"b1","maxRank":3,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your chance to resist Stun and Fear effects by an additional 5% and reduces the cooldown of your Enrage ability by 10 sec.","Increases your chance to resist Stun and Fear effects by an additional 10% and reduces the cooldown of your Enrage ability by 20 sec.","Increases your chance to resist Stun and Fear effects by an additional 15% and reduces the cooldown of your Enrage ability by 30 sec."]],"arrows":[],"icon":"ability_druid_primaltenacity"},"Brutal Impact":{"name":"Brutal Impact","pos":"b2","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the stun duration of your Bash and Pounce abilities by 1 sec.","Increases the stun duration of your Bash and Pounce abilities by 2 sec."]],"arrows":[],"icon":"ability_druid_bash"},"Sharpened Claws":{"name":"Sharpened Claws","pos":"b3","maxRank":3,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your critical strike chance while in Bear or Cat Form by 2%.","Increases your critical strike chance while in Bear or Cat Form by 4%.","Increases your critical strike chance while in Bear or Cat Form by 6%."]],"arrows":[],"icon":"inv_misc_monsterclaw_04"},"Primal Fury":{"name":"Primal Fury","pos":"b4","maxRank":2,"reqPoints":5,"prereq":"Sharpened Claws","dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives you a 50% chance to gain an additional 5 Rage anytime you get a critical strike while in Bear Form.","Gives you a 100% chance to gain an additional 5 Rage anytime you get a critical strike while in Bear Form."]],"arrows":[{"to":"b4","dir":"right","from":"b3"}],"icon":"ability_racial_cannibalize"},"Feline Swiftness":{"name":"Feline Swiftness","pos":"c1","maxRank":2,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your movement speed by 15% while outdoors in Cat Form and increases your chance to dodge by 3%.","Increases your movement speed by 30% while outdoors in Cat Form and increases your chance to dodge by 6%."]],"arrows":[],"icon":"spell_nature_spiritwolf"},"Feral Charge":{"name":"Feral Charge","pos":"c2","maxRank":1,"reqPoints":10,"dependencyName":"","cost":"10 Rage","cooldown":"15 seconds cooldown","descriptions":[["Causes you to charge an enemy, immobilizing and interrupting any spell being cast for 4 seconds."]],"arrows":[],"icon":"ability_hunter_pet_bear"},"Blood Frenzy":{"name":"Blood Frenzy","pos":"c3","maxRank":2,"reqPoints":10,"prereq":"Sharpened Claws","dependencyName":"","cost":"","cooldown":"","descriptions":[["Your critical strikes from Cat Form abilities that add combo points  have a 50% chance to add an additional combo point.","Your critical strikes from Cat Form abilities that add combo points  have a 100% chance to add an additional combo point."]],"arrows":[{"to":"c3","dir":"down","from":"b3"}],"icon":"ability_ghoulfrenzy"},"Leap":{"name":"Leap","pos":"c4","maxRank":1,"reqPoints":10,"dependencyName":"","cost":"50 Energy","cooldown":"30 seconds cooldown","descriptions":[["Remove all movement impairing effects and leap forward. The distance you leap is highly dependent on the terrain."]],"arrows":[],"icon":"ability_hunter_catlikereflexes"},"Feral Instinct":{"name":"Feral Instinct","pos":"d1","maxRank":3,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases threat caused in Bear Form by 5%, reduces the chance enemies have to detect you while Prowling and increases the duration of your Tiger's Fury, Grizzly’s Fury and Challenging Roar abilities by 3 sec.","Increases threat caused in Bear Form by 10%, reduces the chance enemies have to detect you while Prowling and increases the duration of your Tiger's Fury, Grizzly’s Fury and Challenging Roar abilities by 6 sec.","Increases threat caused in Bear Form by 15%, reduces the chance enemies have to detect you while Prowling and increases the duration of your Tiger's Fury, Grizzly’s Fury and Challenging Roar abilities by 9 sec."]],"arrows":[],"icon":"ability_ambush"},"Stalking":{"name":"Stalking","pos":"d2","maxRank":2,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the critical strike chance of your Ravage and Shred abilities by 15%.","Increases the critical strike chance of your Ravage and Shred abilities by 30%."]],"arrows":[],"icon":"spell_shadow_vampiricaura"},"Heart of the Wild":{"name":"Heart of the Wild","pos":"d3","maxRank":5,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your Intellect and Spirit by 6%. In addition, while in Bear Form your Stamina is increased by 3% and while in Cat Form your Strength is increased by 3%.","Increases your Intellect and Spirit by 12%. In addition, while in Bear Form your Stamina is increased by 6% and while in Cat Form your Strength is increased by 6%.","Increases your Intellect and Spirit by 18%. In addition, while in Bear Form your Stamina is increased by 9% and while in Cat Form your Strength is increased by 9%.","Increases your Intellect and Spirit by 24%. In addition, while in Bear Form your Stamina is increased by 12% and while in Cat Form your Strength is increased by 12%.","Increases your Intellect and Spirit by 30%. In addition, while in Bear Form your Stamina is increased by 15% and while in Cat Form your Strength is increased by 15%."]],"arrows":[],"icon":"spell_holy_blessingofagility"},"Savage Fury":{"name":"Savage Fury","pos":"e1","maxRank":2,"reqPoints":20,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the damage caused by your Claw, Rake, Maul and Swipe abilities by 10%.","Increases the damage caused by your Claw, Rake, Maul and Swipe abilities by 20%."]],"arrows":[],"icon":"ability_druid_swipe"},"Predatory Strikes":{"name":"Predatory Strikes","pos":"e2","maxRank":3,"reqPoints":20,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your melee attack power in Cat and Bear Forms by 100% of your level. Also, increases your Attack Rating skill by 4.","Increases your melee attack power in Cat and Bear Forms by 200% of your level. Also, increases your Attack Rating skill by 7.","Increases your melee attack power in Cat and Bear Forms by 300% of your level. Also, increases your Attack Rating skill by 10."]],"arrows":[],"icon":"ability_hunter_pet_cat"},"Untamed Heart":{"name":"Untamed Heart","pos":"e3","maxRank":1,"reqPoints":20,"prereq":"Heart of the Wild","dependencyName":"","cost":"","cooldown":"10 minutes cooldown","descriptions":[["Heal yourself for 20% of your maximum health, and increases your maximum health by 20% for 20 sec."]],"arrows":[{"to":"e3","dir":"down","from":"d3"}],"icon":"druid_batte_roar"},"Killer Instincts":{"name":"Killer Instincts","pos":"f2","maxRank":5,"reqPoints":25,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases all damage caused by 1%. In addition, your melee critical strikes will increase your attack speed by 10% for your next 3 attacks.","Increases all damage caused by 2%. In addition, your melee critical strikes will increase your attack speed by 15% for your next 3 attacks.","Increases all damage caused by 3%. In addition, your melee critical strikes will increase your attack speed by 20% for your next 3 attacks.","Increases all damage caused by 4%. In addition, your melee critical strikes will increase your attack speed by 25% for your next 3 attacks.","Increases all damage caused by 5%. In addition, your melee critical strikes will increase your attack speed by 30% for your next 3 attacks."]],"arrows":[],"icon":"ability_druid_predatoryinstincts"},"Survival Instincts":{"name":"Survival Instincts","pos":"f3","maxRank":5,"reqPoints":25,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the chance you'll be critically hit by melee attacks by 1%. In addition, your critical strikes restore 1% of your maximum health. This effect can only occur once every 3 sec.","Reduces the chance you'll be critically hit by melee attacks by 2%. In addition, your critical strikes restore 2% of your maximum health. This effect can only occur once every 3 sec.","Reduces the chance you'll be critically hit by melee attacks by 3%. In addition, your critical strikes restore 3% of your maximum health. This effect can only occur once every 3 sec.","Reduces the chance you'll be critically hit by melee attacks by 4%. In addition, your critical strikes restore 4% of your maximum health. This effect can only occur once every 3 sec.","Reduces the chance you'll be critically hit by melee attacks by 6%. In addition, your critical strikes restore 5% of your maximum health. This effect can only occur once every 3 sec."]],"arrows":[],"icon":"survival_instinctz"},"Leader of the Pack":{"name":"Leader of the Pack","pos":"g2","maxRank":1,"reqPoints":30,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Doubles the effects of your Bear and Cat Forms.\n\nAlso, while in Cat or Bear Form, the Leader of the Pack increases ranged and melee critical chance of all raid members within 20 yards by 3%."]],"arrows":[],"icon":"spell_nature_unyeildingstamina"}}}}