{"Feral":{"name":"Feral","background":"feral","icon":"","talents":{"Animalistic Frenzy":{"name":"Animalistic Frenzy","pos":"b4","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["The Enrage ability now instantly generates 5 Rage.","The Enrage ability now instantly generates 10 Rage."]],"arrows":[],"icon":"ability_druid_enrage"},"Furor":{"name":"Furor","pos":"a4","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the global cooldown of shapeshifting by 0.2 sec.","Reduces the global cooldown of shapeshifting by 0.4 sec.","Reduces the global cooldown of shapeshifting by 0.6 sec.","Reduces the global cooldown of shapeshifting by 0.8 sec.","Reduces the global cooldown of shapeshifting by 1 sec."]],"arrows":[],"icon":"spell_holy_blessingofstamina"},"Ferocity":{"name":"Ferocity","pos":"a2","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 1 Rage or Energy.","Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 2 Rage or Energy.","Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 3 Rage or Energy.","Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 4 Rage or Energy.","Reduces the cost of your Maul, Swipe, Claw, and Rake abilities by 5 Rage or Energy."]],"arrows":[],"icon":"ability_hunter_pet_hyena"},"Feral Aggression":{"name":"Feral Aggression","pos":"a3","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the Attack Power reduction of your Demoralizing Roar by 8% and the damage caused by your Ferocious Bite by 3%.","Increases the Attack Power reduction of your Demoralizing Roar by 16% and the damage caused by your Ferocious Bite by 6%.","Increases the Attack Power reduction of your Demoralizing Roar by 24% and the damage caused by your Ferocious Bite by 9%.","Increases the Attack Power reduction of your Demoralizing Roar by 32% and the damage caused by your Ferocious Bite by 12%.","Increases the Attack Power reduction of your Demoralizing Roar by 40% and the damage caused by your Ferocious Bite by 15%."]],"arrows":[],"icon":"ability_druid_demoralizingroar"},"Feral Instinct":{"name":"Feral Instinct","pos":"b1","maxRank":3,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases threat caused in Bear and Dire Bear Form by 5% and reduces the chance enemies have to detect you while Prowling.","Increases threat caused in Bear and Dire Bear Form by 10% and reduces the chance enemies have to detect you while Prowling.","Increases threat caused in Bear and Dire Bear Form by 15% and reduces the chance enemies have to detect you while Prowling."]],"arrows":[],"icon":"ability_ambush"},"Brutal Impact":{"name":"Brutal Impact","pos":"b2","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the stun duration of your Bash and Pounce abilities by 0.5 sec, and gives your Pounce ability a 50% chance to add an additional combo point to the target.","Increases the stun duration of your Bash and Pounce abilities by 1 sec, and gives your Pounce ability a 100% chance to add an additional combo point to the target."]],"arrows":[],"icon":"ability_druid_bash"},"Thick Hide":{"name":"Thick Hide","pos":"b3","maxRank":3,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your Armor contribution from items by 10%, and reduces the chance you are critically struck by ranged and melee attacks by 2%.","Increases your Armor contribution from items by 20%, and reduces the chance you are critically struck by ranged and melee attacks by 4%.","Increases your Armor contribution from items by 30%, and reduces the chance you are critically struck by ranged and melee attacks by 6%."]],"arrows":[],"icon":"inv_misc_pelt_bear_03"},"Feline Swiftness":{"name":"Feline Swiftness","pos":"c1","maxRank":2,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your movement speed by 15% while outdoors in Cat Form and increases your chance to dodge while in Cat Form by 5%.","Increases your movement speed by 30% while in Cat Form and increases your chance to dodge while outdoors in Cat Form by 10%."]],"arrows":[],"icon":"spell_nature_spiritwolf"},"Feral Charge":{"name":"Feral Charge","pos":"c2","maxRank":1,"reqPoints":10,"dependencyName":"","cost":"5 Rage","cooldown":"15 seconds cooldown","descriptions":[["Causes you to charge an enemy, immobilizing and interrupting any spell being cast for 4 seconds. Removes all movement impairing effects."]],"arrows":[],"icon":"ability_hunter_pet_bear"},"Sharpened Claws":{"name":"Sharpened Claws","pos":"c3","maxRank":5,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your critical strike chance while in Bear, Dire Bear or Cat Form by 2%.","Increases your critical strike chance while in Bear, Dire Bear or Cat Form by 4%.","Increases your critical strike chance while in Bear, Dire Bear or Cat Form by 6%.","Increases your critical strike chance while in Bear, Dire Bear or Cat Form by 8%.","Increases your critical strike chance while in Bear, Dire Bear or Cat Form by 10%."]],"arrows":[],"icon":"inv_misc_monsterclaw_04"},"Rip & Tear":{"name":"Rip & Tear","pos":"d1","maxRank":3,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the Energy cost of your Shred, Rip, and Ferocious Bite abilities by 5.","Reduces the Energy cost of your Shred, Rip, and Ferocious Bite abilities by 10.","Reduces the Energy cost of your Shred, Rip, and Ferocious Bite abilities by 15."]],"arrows":[],"icon":"spell_shadow_vampiricaura"},"Predatory Strikes":{"name":"Predatory Strikes","pos":"d2","maxRank":3,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your melee attack power in Cat, Bear, Dire Bear, and Moonkin Forms by 50% of your spirit.","Increases your melee attack power in Cat, Bear, Dire Bear, and Moonkin Forms by 100% of your spirit.","Increases your melee attack power in Cat, Bear, Dire Bear, and Moonkin Forms by 150% of your spirit."]],"arrows":[],"icon":"ability_hunter_pet_cat"},"Blood Frenzy":{"name":"Blood Frenzy","pos":"d3","maxRank":2,"reqPoints":15,"prereq":"Sharpened Claws","dependencyName":"","cost":"","cooldown":"","descriptions":[["Your critical strikes from Cat Form abilities that add combo points have a 50% chance to add an additional combo point.","Your critical strikes from Cat Form abilities that add combo points have a 100% chance to add an additional combo point."]],"arrows":[{"to":"d3","dir":"down","from":"c3"}],"icon":"ability_ghoulfrenzy"},"Primal Fury":{"name":"Primal Fury","pos":"d4","maxRank":2,"reqPoints":15,"prereq":"Sharpened Claws","dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives you a 50% chance to gain an additional 5 Rage anytime you get a critical strike while in Bear and Dire Bear Form.","Gives you a 100% chance to gain an additional 5 Rage anytime you get a critical strike while in Bear and Dire Bear Form."]],"arrows":[{"to":"c4","dir":"right-down","from":"c3"},{"to":"d4","dir":"right-down-down","from":"c4"}],"icon":"ability_racial_cannibalize"},"Savage Fury":{"name":"Savage Fury","pos":"e1","maxRank":1,"reqPoints":20,"prereq":"Rip & Tear","dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the damage caused by your Claw, Rake, Maul and Swipe abilities by 20%."]],"arrows":[{"to":"e1","dir":"down","from":"d1"}],"icon":"ability_druid_ravage"},"Faerie Fire (Feral)":{"name":"Faerie Fire (Feral)","pos":"e3","maxRank":1,"reqPoints":20,"dependencyName":"","cost":"","cooldown":"6 seconds cooldown","descriptions":[["Decrease the armor of the target by 175 for 40 seconds.  While affected, the target cannot stealth or turn invisible."]],"arrows":[],"icon":"spell_nature_faeriefire"},"Heart of the Wild":{"name":"Heart of the Wild","pos":"f2","maxRank":5,"reqPoints":25,"prereq":"Predatory Strikes","dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your Intellect by 6%.  In addition, while in Bear or Dire Bear Form your Stamina is increased by 6% and while in Cat Form your Strength is increased by 6%.","Increases your Intellect by 12%.  In addition, while in Bear or Dire Bear Form your Stamina is increased by 12% and while in Cat Form your Strength is increased by 12%.","Increases your Intellect by 18%.  In addition, while in Bear or Dire Bear Form your Stamina is increased by 18% and while in Cat Form your Strength is increased by 18%.","Increases your Intellect by 24%.  In addition, while in Bear or Dire Bear Form your Stamina is increased by 24% and while in Cat Form your Strength is increased by 24%.","Increases your Intellect by 30%.  In addition, while in Bear or Dire Bear Form your Stamina is increased by 30% and while in Cat Form your Strength is increased by 30%."]],"arrows":[{"to":"f2","dir":"down","from":"d2"}],"icon":"spell_holy_blessingofagility"},"Leader of the Pack":{"name":"Leader of the Pack","pos":"g2","maxRank":1,"reqPoints":30,"dependencyName":"","cost":"","cooldown":"","descriptions":[["While in Cat, Bear or Dire Bear Form, the Leader of the Pack increases ranged and melee critical chance of all friendly units within 45 yards by 3%."]],"arrows":[],"icon":"spell_nature_unyeildingstamina"}}}}