{
    "Cold Grip": [
        {
            "property": "dependencyName",
            "value": "Permafrost"
        },
        {
            "property": "descriptions",
            "value": [
                    [
                        "Increases the damage dealt by your Cone of Cold and Ice Shards by 15% and reduces the cooldown of Cone of Cold and Cold Snap by 25%. In addition, your Blizzard spell chills targets, reducing their movement speed by 25% for 2 seconds.",
                        "Increases the damage dealt by your Cone of Cold and Ice Shards by 30% and reduces the cooldown of Cone of Cold and Cold Snap by 50%. In addition, your Blizzard spell chills targets, reducing their movement speed by 50% for 2 seconds."
                    ],
                    [
                        "Increases the damage dealt by your Cone of Cold and Ice Shards by 15% and reduces the cooldown of Cone of Cold and Cold Snap by 25%. In addition, your Blizzard spell chills targets, reducing their movement speed by 29% for 2 seconds.",
                        "Increases the damage dealt by your Cone of Cold and Ice Shards by 30% and reduces the cooldown of Cone of Cold and Cold Snap by 50%. In addition, your Blizzard spell chills targets, reducing their movement speed by 54% for 2 seconds."
                    ],
                    [
                        "Increases the damage dealt by your Cone of Cold and Ice Shards by 15% and reduces the cooldown of Cone of Cold and Cold Snap by 25%. In addition, your Blizzard spell chills targets, reducing their movement speed by 32% for 2 seconds.",
                        "Increases the damage dealt by your Cone of Cold and Ice Shards by 30% and reduces the cooldown of Cone of Cold and Cold Snap by 50%. In addition, your Blizzard spell chills targets, reducing their movement speed by 57% for 2 seconds."
                    ],
                    [
                        "Increases the damage dealt by your Cone of Cold and Ice Shards by 15% and reduces the cooldown of Cone of Cold and Cold Snap by 25%. In addition, your Blizzard spell chills targets, reducing their movement speed by 35% for 2 seconds.",
                        "Increases the damage dealt by your Cone of Cold and Ice Shards by 30% and reduces the cooldown of Cone of Cold and Cold Snap by 50%. In addition, your Blizzard spell chills targets, reducing their movement speed by 60% for 2 seconds."
                    ]
                ]
        }
    ]
}