{"Beast Mastery":{"name":"Beast Mastery","background":"beast mastery","icon":"","talents":{"Improved Aspect of the Monkey":{"name":"Improved Aspect of the Monkey","pos":"a1","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the dodge and melee Crit bonuses of Aspect of the Monkey by 1%.","Increases the dodge and melee Crit bonuses of Aspect of the Monkey by 2%.","Increases the dodge and melee Crit bonuses of Aspect of the Monkey by 3%."],"arrows":[],"icon":"ability_hunter_aspectofthemonkey"},"Improved Aspect of the Hawk":{"name":"Improved Aspect of the Hawk","pos":"a2","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["While Aspect of the Hawk is active, gives you a 10% chance of increasing ranged attack speed by 30% for 8 seconds after dealing a critical strike with a ranged attack.","While Aspect of the Hawk is active, gives you a 20% chance of increasing ranged attack speed by 30% for 8 seconds after dealing a critical strike with a ranged attack.","While Aspect of the Hawk is active, gives you a 30% chance of increasing ranged attack speed by 30% for 8 seconds after dealing a critical strike with a ranged attack.","While Aspect of the Hawk is active, gives you a 40% chance of increasing ranged attack speed by 30% for 8 seconds after dealing a critical strike with a ranged attack.","While Aspect of the Hawk is active, gives you a 50% chance of increasing ranged attack speed by 30% for 8 seconds after dealing a critical strike with a ranged attack."],"arrows":[],"icon":"spell_nature_ravenform"},"Endurance Training":{"name":"Endurance Training","pos":"a3","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the Health of your pets by 10%.","Increases the Health of your pets by 20%."],"arrows":[],"icon":"spell_nature_reincarnation"},"Thick Hide":{"name":"Thick Hide","pos":"b1","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the Armor rating of your pets by 15%.","Increases the Armor rating of your pets by 30%.","Increases the Armor rating of your pets by 45%."],"arrows":[],"icon":"inv_misc_pelt_bear_03"},"Improved Mend Pet":{"name":"Improved Mend Pet","pos":"b2","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Gives the Mend Pet spell a 15% chance of restoring 50 Focus and removing 1 Curse, Disease, Magic, Poison or Fear effect from the pet each tick.","Gives the Mend Pet spell a 30% chance of restoring 50 Focus and removing 1 Curse, Disease, Magic, Poison or Fear effect from the pet each tick."],"arrows":[],"icon":"ability_hunter_mendpet"},"Aspect Mastery":{"name":"Aspect Mastery","pos":"b3","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the effectiveness of your Aspect of the Beast, Aspect of the Cheetah, Aspect of the Pack and Aspect of the Wild by 25% and reduces the mana cost of all your Aspects by 50%.","Increases the effectiveness of your Aspect of the Beast, Aspect of the Cheetah, Aspect of the Pack and Aspect of the Wild by 50% and reduces the mana cost of all your Aspects by 100%."],"arrows":[],"icon":"ability_hunter_aspectmastery"},"Improved Revive Pet":{"name":"Improved Revive Pet","pos":"b4","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Revive Pet's casting time is reduced by 3 sec, mana cost is reduced by 50%, and increases the health your pet returns with by an additional 15%.","Revive Pet's casting time is reduced by 6 sec, mana cost is reduced by 100%, and increases the health your pet returns with by an additional 30%."],"arrows":[],"icon":"ability_hunter_beastsoothe"},"Intimidation":{"name":"Intimidation","pos":"c2","maxRank":1,"reqPoints":10,"cost":"","cooldown":"1 minute cooldown","descriptions":["Command your pet to intimidate the target on the next successful melee attack, causing a high amount of threat and stunning the target for 4 seconds."],"arrows":[],"icon":"ability_devour"},"Unleashed Fury":{"name":"Unleashed Fury","pos":"c3","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the damage done by your pets by 2%.","Increases the damage done by your pets by 4%.","Increases the damage done by your pets by 6%.","Increases the damage done by your pets by 8%.","Increases the damage done by your pets by 10%."],"arrows":[],"icon":"ability_bullrush"},"Bestial Swiftness":{"name":"Bestial Swiftness","pos":"c4","maxRank":3,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the movement speed of your pets by 10% and their dodge chance by 5%.","Increases the movement speed of your pets by 20% and their dodge chance by 10%.","Increases the movement speed of your pets by 30% and their dodge chance by 15%."],"arrows":[],"icon":"ability_druid_dash"},"Survival Instincts":{"name":"Survival Instincts","pos":"d1","maxRank":3,"reqPoints":15,"prereq":"Thick Hide","cost":"","cooldown":"","descriptions":["Reduces the chance your pets are critically hit by melee attacks by 2% and increases the chance your pets avoid area of effect spells by an additional 30%.","Reduces the chance your pets are critically hit by melee attacks by 4% and increases the chance your pets avoid area of effect spells by an additional 60%.","Reduces the chance your pets are critically hit by melee attacks by 6% and increases the chance your pets avoid area of effect spells by an additional 90%."],"arrows":[{"to":"d1","dir":"down","from":"b1"}],"icon":"survival_instinctz"},"Bestial Discipline":{"name":"Bestial Discipline","pos":"d2","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the Focus regeneration of your pets by 50%.","Increases the Focus regeneration of your pets by 100%."],"arrows":[],"icon":"spell_nature_abolishmagic"},"Ferocity":{"name":"Ferocity","pos":"d3","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the critical strike chance of your pets by 3%.","Increases the critical strike chance of your pets by 6%.","Increases the critical strike chance of your pets by 9%.","Increases the critical strike chance of your pets by 12%.","Increases the critical strike chance of your pets by 15%."],"arrows":[],"icon":"inv_misc_monsterclaw_04"},"Team Play":{"name":"Team Play","pos":"e1","maxRank":2,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Your attacks have a 10% chance to Invigorate your pet, instantly granting them 50 focus and freeing them from 1 Poison, Disease, Magic, Curse, or Fear effects\n\nYour pet attacks have a chance to inspire you, reducing Mana cost of your next spell or ability by 100% for 5 seconds.","Your attacks have a 20% chance to Invigorate your pet, instantly granting them 50 focus and freeing them from 1 Poison, Disease, Magic, Curse, or Fear effects\n\nYour pet attacks have a chance to inspire you, reducing Mana cost of your next spell or ability by 100% for 5 seconds. More effective than Team Play (Rank 1)."],"arrows":[],"icon":"ability_hunter_beastwithin"},"Bestial Wrath":{"name":"Bestial Wrath","pos":"e2","maxRank":1,"reqPoints":20,"cost":"12% Base Mana","cooldown":"3 minutes cooldown","descriptions":["Send your pet into a rage causing 20% additional damage for 30 seconds.  While enraged, the beast does not feel pity or remorse or fear and it cannot be stopped unless killed."],"arrows":[],"icon":"ability_druid_ferociousbite"},"Savage Flurry":{"name":"Savage Flurry","pos":"e4","maxRank":5,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Increases your and your pet's attack speed by 3%.","Increases your and your pet's attack speed by 6%.","Increases your and your pet's attack speed by 9%.","Increases your and your pet's attack speed by 12%.","Increases your and your pet's attack speed by 15%."],"arrows":[],"icon":"ability_druid_swipe"},"Spirit Bond":{"name":"Spirit Bond","pos":"f1","maxRank":5,"reqPoints":25,"prereq":"Team Play","cost":"","cooldown":"","descriptions":["Your pet get Attack Power, bonus to Critical strike chance and Stamina equal to 6% of your Attack Power, Critical strike chance and Stamina.\n\nWhile your pet is active, you will regenerate 1% of your total health every 10 sec.","Your pet get Attack Power, bonus to Critical strike chance and Stamina equal to 12% of your Attack Power, Critical strike chance and Stamina.\n\nWhile your pet is active, you will regenerate 1% of your total health every 8 sec.","Your pet get Attack Power, bonus to Critical strike chance and Stamina equal to 18% of your Attack Power, Critical strike chance and Stamina.\n\nWhile your pet is active, you will regenerate 1% of your total health every 6 sec.","Your pet get Attack Power, bonus to Critical strike chance and Stamina equal to 24% of your Attack Power, Critical strike chance and Stamina.\n\nWhile your pet is active, you will regenerate 1% of your total health every 4 sec.","Your pet get Attack Power, bonus to Critical strike chance and Stamina equal to 30% of your Attack Power, Critical strike chance and Stamina.\n\nWhile your pet is active, you will regenerate 1% of your total health every 2 sec."],"arrows":[{"to":"f1","dir":"down","from":"e1"}],"icon":"ability_hunter_separationanxiety"},"Frenzy":{"name":"Frenzy","pos":"f3","maxRank":5,"reqPoints":25,"prereq":"Ferocity","cost":"","cooldown":"","descriptions":["Gives your pet a 20% chance to gain a 30% attack speed increase for next 5 attacks or for 15 seconds after dealing a critical strike. ","Gives your pet a 40% chance to gain a 30% attack speed increase for next 5 attacks or for 15 seconds after dealing a critical strike. ","Gives your pet a 60% chance to gain a 30% attack speed increase for next 5 attacks or for 15 seconds after dealing a critical strike. ","Gives your pet a 80% chance to gain a 30% attack speed increase for next 5 attacks or for 15 seconds after dealing a critical strike. ","Gives your pet a 100% chance to gain a 30% attack speed increase for next 5 attacks or for 15 seconds after dealing a critical strike. "],"arrows":[{"to":"f3","dir":"down","from":"d3"}],"icon":"inv_misc_monsterclaw_03"},"Kill Command":{"name":"Kill Command","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Bestial Wrath","cost":"","cooldown":"5 seconds cooldown","descriptions":["Give the command to kill, increasing damage done by your pet by 50% for 5 seconds. Only usable against enemies that have 20% or less health."],"arrows":[{"to":"g2","dir":"down","from":"e2"}],"icon":"ability_hunter_killcommand"},"Terrifying Roar":{"name":"Terrifying Roar","pos":"g3","maxRank":1,"reqPoints":30,"cost":"25% Base Mana","cooldown":"3 minutes cooldown","descriptions":["Roars at an enemy, paralyzing it with terror for 5 seconds. In addition, up to NaN total nearby enemies will flee in fear for 10 seconds."],"arrows":[],"icon":"stampede"}}}}