{"Survival":{"name":"Survival","background":"survival","icon":"","talents":{"Deflection":{"name":"Deflection","pos":"a1","maxRank":4,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases your Parry chance by 2%.","Increases your Parry chance by 3%.","Increases your Parry chance by 4%.","Increases your Parry chance by 5%."],"arrows":[],"icon":"ability_parry"},"Deterrence":{"name":"Deterrence","pos":"a2","maxRank":1,"reqPoints":0,"prereq":"Deflection","cost":"","cooldown":"3 minutes cooldown","descriptions":["Increases your chance to Dodge and Parry by 25% and reflects the next spell cast on you. Lasts 10 seconds."],"arrows":[{"to":"a2","dir":"right","from":"a1"}],"icon":"ability_whirlwind"},"Brutality":{"name":"Brutality","pos":"a3","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases your and your pet's chance to get a critical strike in melee by 1%. Also increases the critical strike chance of Raptor Strike and Mongoose Bite by an additional 2%.","Increases your and your pet's chance to get a critical strike in melee by 2%. Also increases the critical strike chance of Raptor Strike and Mongoose Bite by an additional 4%.","Increases your and your pet's chance to get a critical strike in melee by 3%. Also increases the critical strike chance of Raptor Strike and Mongoose Bite by an additional 6%.","Increases your and your pet's chance to get a critical strike in melee by 4%. Also increases the critical strike chance of Raptor Strike and Mongoose Bite by an additional 8%.","Increases your and your pet's chance to get a critical strike in melee by 5%. Also increases the critical strike chance of Raptor Strike and Mongoose Bite by an additional 10%."],"arrows":[],"icon":"ability_criticalstrike"},"Clever Traps":{"name":"Clever Traps","pos":"b1","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the duration of Freezing and Frost trap effects by 15% and the damage of Immolation and Explosive trap effects by 15%.","Increases the duration of Freezing and Frost trap effects by 30% and the damage of Immolation and Explosive trap effects by 30%."],"arrows":[],"icon":"spell_nature_timestop"},"Improved Tracking":{"name":"Improved Tracking","pos":"c4","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["While tracking Beasts, Demons, Dragonkin, Elementals, Giants, Humanoids and Undead, all damage caused to those types by the Hunter is increased by 3%. Also increases the effectiveness of Track Hidden.","While tracking Beasts, Demons, Dragonkin, Elementals, Giants, Humanoids and Undead, all damage caused to those types by the Hunter is increased by 6%. Also increases the effectiveness of Track Hidden.","While tracking Beasts, Demons, Dragonkin, Elementals, Giants, Humanoids and Undead, all damage caused to those types by the Hunter is increased by 9%. Also increases the effectiveness of Track Hidden.","While tracking Beasts, Demons, Dragonkin, Elementals, Giants, Humanoids and Undead, all damage caused to those types by the Hunter is increased by 12%. Also increases the effectiveness of Track Hidden.","While tracking Beasts, Demons, Dragonkin, Elementals, Giants, Humanoids and Undead, all damage caused to those types by the Hunter is increased by 15%. Also increases the effectiveness of Track Hidden."],"arrows":[],"icon":"ability_tracking"},"Improved Wing Clip":{"name":"Improved Wing Clip","pos":"b3","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Gives your Wing Clip ability a 5% chance to immobilize the target for 5 seconds.","Gives your Wing Clip ability a 10% chance to immobilize the target for 5 seconds.","Gives your Wing Clip ability a 15% chance to immobilize the target for 5 seconds."],"arrows":[],"icon":"ability_rogue_trip"},"Improved Raptor Strike":{"name":"Improved Raptor Strike","pos":"b4","maxRank":5,"reqPoints":5,"prereq":"Brutality","cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Raptor Strike by 1 sec.","Reduces the cooldown of your Raptor Strike by 2 sec.","Reduces the cooldown of your Raptor Strike by 3 sec.","Reduces the cooldown of your Raptor Strike by 4 sec.","Reduces the cooldown of your Raptor Strike by 5 sec."],"arrows":[{"to":"a4","dir":"right-down","from":"a3"},{"to":"b4","dir":"right-down-down","from":"a4"}],"icon":"ability_meleedamage"},"Dual Wield Specialization":{"name":"Dual Wield Specialization","pos":"c1","maxRank":4,"reqPoints":10,"prereq":"Melee Specialization","cost":"","cooldown":"","descriptions":["Increases the damage done by your offhand weapon by 20%.","Increases the damage done by your offhand weapon by 30%.","Increases the damage done by your offhand weapon by 40%.","Increases the damage done by your offhand weapon by 50%."],"arrows":[{"to":"c1","dir":"left","from":"c2"}],"icon":"ability_dualwield"},"Melee Specialization":{"name":"Melee Specialization","pos":"c2","maxRank":1,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases your melee attack speed by 20% but reduces your ranged attack speed by 20% and increases the shot time of your Aimed Shot and Multi-Shot by 1.499 sec."],"arrows":[],"icon":"inv_axe_02"},"Two-Handed Weapon Specialization":{"name":"Two-Handed Weapon Specialization","pos":"c3","maxRank":4,"reqPoints":10,"prereq":"Melee Specialization","cost":"","cooldown":"","descriptions":["Increases the damage you deal with two-handed melee weapons by 4%.","Increases the damage you deal with two-handed melee weapons by 6%.","Increases the damage you deal with two-handed melee weapons by 8%.","Increases the damage you deal with two-handed melee weapons by 10%."],"arrows":[{"to":"c3","dir":"right","from":"c2"}],"icon":"inv_weapon_halberd_03"},"Survivalist":{"name":"Survivalist","pos":"b2","maxRank":5,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Decreases damage taken by 2%.  In addition, cures 1 poison effect from you every 40 sec.","Decreases damage taken by 4%.  In addition, cures 1 poison effect from you every 30 sec.","Decreases damage taken by 6%.  In addition, cures 1 poison effect from you every 25 sec.","Decreases damage taken by 8%.  In addition, cures 1 poison effect from you every 20 sec.","Decreases damage taken by 10%.  In addition, cures 1 poison effect from you every 15 sec."],"arrows":[],"icon":"spell_shadow_twilight"},"Trapper":{"name":"Trapper","pos":"d1","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Gives your traps a 10% chance to entrap the target, preventing them from moving for 5 seconds. In addition, decreases the chance enemies will resist Feign Death and trap effects by 5%.","Gives your traps a 20% chance to entrap the target, preventing them from moving for 5 seconds. In addition, decreases the chance enemies will resist Feign Death and trap effects by 10%."],"arrows":[],"icon":"ability_ensnare"},"Killer Instinct":{"name":"Killer Instinct","pos":"d3","maxRank":3,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases hit and crit chance by 1% for both you and your pet.","Increases hit and crit chance by 2% for both you and your pet.","Increases hit and crit chance by 3% for both you and your pet."],"arrows":[],"icon":"spell_holy_blessingofstamina"},"Thrill of the Hunt":{"name":"Thrill of the Hunt","pos":"d4","maxRank":3,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Your melee and ranged attacks have a chance to restore Mana equal to triple your level.","Your melee and ranged attacks have a chance to restore Mana equal to triple your level. Effect occurs more often than Thrill of the Hunt (Rank 1).","Your melee and ranged attacks have a chance to restore Mana equal to triple your level. Effect occurs more often than Thrill of the Hunt (Rank 2)."],"arrows":[],"icon":"ability_hunter_thrillofthehunt"},"Deep Freeze":{"name":"Deep Freeze","pos":"e1","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Physical attacks against the target, affected by your Freezing Trap, have an additional 15% to be critical. In addition, increases the movement speed reduction of your Frost Trap by 10%.","Physical attacks against the target, affected by your Freezing Trap, have an additional 30% to be critical. In addition, increases the movement speed reduction of your Frost Trap by 20%.","Physical attacks against the target, affected by your Freezing Trap, have an additional 45% to be critical. In addition, increases the movement speed reduction of your Frost Trap by 30%."],"arrows":[],"icon":"spell_frost_frozendecay"},"Savage Blow":{"name":"Savage Blow","pos":"e2","maxRank":1,"reqPoints":20,"prereq":"Melee Specialization","cost":"12% Base Mana","cooldown":"6 seconds cooldown","descriptions":["Wild strike with both weapons that grants bonus effects dependent on your active Aspect.\n\nAspect of the Beast: \nSavage Blow hits additional enemies near the target.\n\nAspect of the Cheetah: \nMakes you immune to movement impairing effects for 5 seconds.\n\nAspect of the Hawk: \nIncreases the range of Savage Blow by 6 yd.\n\nAspect of the Monkey: \nAllows you to use Mongoose Bite.\n\nAspect of the Pack: \nReduces the cost of all spells and abilities\nof all nearby party members by 10% for 20 seconds.\n\nAspect of the Wild: \nRegenerates 5% of your total Health over 25 seconds.\nStacks up to 5 times."],"arrows":[{"to":"e2","dir":"down","from":"c2"}],"icon":"amulet_of_wild"},"Wyvern Sting":{"name":"Wyvern Sting","pos":"e3","maxRank":1,"reqPoints":20,"prereq":"Killer Instinct","cost":"115 Mana","cooldown":"1 minute cooldown","descriptions":["A stinging shot that puts the target to sleep for up to 1 minute.  Any damage will cancel the effect.  When the target wakes up, the Sting slowing movement speed by 30% and causes 2 Nature damage over 10 seconds.\nOnly usable out of combat.  Only one Sting per Hunter can be active on the target at a time."],"arrows":[{"to":"e3","dir":"down","from":"d3"}],"icon":"inv_spear_02"},"Find Weakness":{"name":"Find Weakness","pos":"f2","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Your ranged critical strikes have a 20% chance to reveal a flaw in your target's defenses, increasing the critical strike chance of attacks made against that target by an additional 5% for 15 seconds.","Your ranged critical strikes have a 40% chance to reveal a flaw in your target's defenses, increasing the critical strike chance of attacks made against that target by an additional 5% for 15 seconds.","Your ranged critical strikes have a 60% chance to reveal a flaw in your target's defenses, increasing the critical strike chance of attacks made against that target by an additional 5% for 15 seconds.","Your ranged critical strikes have a 80% chance to reveal a flaw in your target's defenses, increasing the critical strike chance of attacks made against that target by an additional 5% for 15 seconds.","Your ranged critical strikes have a 100% chance to reveal a flaw in your target's defenses, increasing the critical strike chance of attacks made against that target by an additional 5% for 15 seconds."],"arrows":[],"icon":"ability_rogue_findweakness"},"Lightning Reflexes":{"name":"Lightning Reflexes","pos":"f3","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Increases your attack speed and Agility by 2%.","Increases your attack speed and Agility by 4%.","Increases your attack speed and Agility by 6%.","Increases your attack speed and Agility by 8%.","Increases your attack speed and Agility by 10%."],"arrows":[],"icon":"spell_nature_invisibilty"},"Whirling Axe":{"name":"Whirling Axe","pos":"g2","maxRank":1,"reqPoints":30,"cost":"10% Base Mana","cooldown":"15 seconds cooldown","descriptions":["Hurls an axe at a target, causing damage equal to 10% of your melee attack power and slowing the target's movement speed by 50% for 10 seconds. This attack always crits. It also interrupts spellcasting and prevents any spell in that school from being cast for 5 seconds."],"arrows":[],"icon":"inv_axe_08"}}}}