{"Survival":{"name":"Survival","background":"survival","icon":"","talents":{"Monster Slaying":{"name":"Monster Slaying","pos":"a1","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases all damage caused against Beasts, Giants and Dragonkin targets by 1% and increases critical damage caused against Beasts, Giants and Dragonkin targets by an additional 1%.","Increases all damage caused against Beasts, Giants and Dragonkin targets by 2% and increases critical damage caused against Beasts, Giants and Dragonkin targets by an additional 2%.","Increases all damage caused against Beasts, Giants and Dragonkin targets by 3% and increases critical damage caused against Beasts, Giants and Dragonkin targets by an additional 3%.","Increases all damage caused against Beasts, Giants and Dragonkin targets by 4% and increases critical damage caused against Beasts, Giants and Dragonkin targets by an additional 4%.","Increases all damage caused against Beasts, Giants and Dragonkin targets by 5% and increases critical damage caused against Beasts, Giants and Dragonkin targets by an additional 5%."]],"arrows":[],"icon":"inv_misc_head_dragon_black"},"Humanoid Slaying":{"name":"Humanoid Slaying","pos":"a2","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases all damage caused against Humanoid targets by 1% and increases critical damage caused against Humanoid targets by an additional 1%.","Increases all damage caused against Humanoid targets by 2% and increases critical damage caused against Humanoid targets by an additional 2%.","Increases all damage caused against Humanoid targets by 3% and increases critical damage caused against Humanoid targets by an additional 3%.","Increases all damage caused against Humanoid targets by 4% and increases critical damage caused against Humanoid targets by an additional 4%.","Increases all damage caused against Humanoid targets by 5% and increases critical damage caused against Humanoid targets by an additional 5%."]],"arrows":[],"icon":"spell_holy_prayerofhealing"},"Deflection":{"name":"Deflection","pos":"a3","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your Parry chance by 1%.","Increases your Parry chance by 2%.","Increases your Parry chance by 3%.","Increases your Parry chance by 4%.","Increases your Parry chance by 5%."]],"arrows":[],"icon":"ability_parry"},"Entrapment":{"name":"Entrapment","pos":"b1","maxRank":5,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives your Immolation Trap, Frost Trap, and Explosive Trap a 5% chance to entrap the target, preventing them from moving for 5 seconds.","Gives your Immolation Trap, Frost Trap, and Explosive Trap a 10% chance to entrap the target, preventing them from moving for 5 seconds.","Gives your Immolation Trap, Frost Trap, and Explosive Trap a 15% chance to entrap the target, preventing them from moving for 5 seconds.","Gives your Immolation Trap, Frost Trap, and Explosive Trap a 20% chance to entrap the target, preventing them from moving for 5 seconds.","Gives your Immolation Trap, Frost Trap, and Explosive Trap a 25% chance to entrap the target, preventing them from moving for 5 seconds."]],"arrows":[],"icon":"spell_nature_stranglevines"},"Savage Strikes":{"name":"Savage Strikes","pos":"b2","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the critical strike chance of Raptor Strike and Mongoose Bite by 10%.","Increases the critical strike chance of Raptor Strike and Mongoose Bite by 20%."]],"arrows":[],"icon":"ability_racial_bloodrage"},"Ensnare":{"name":"Ensnare","pos":"b3","maxRank":5,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives your Wing Clip ability a 20% chance to reduce the target's attack speed by 15% for 5 seconds.","Gives your Wing Clip ability a 40% chance to reduce the target's attack speed by 15% for 5 seconds.","Gives your Wing Clip ability a 60% chance to reduce the target's attack speed by 15% for 5 seconds.","Gives your Wing Clip ability a 80% chance to reduce the target's attack speed by 15% for 5 seconds.","Gives your Wing Clip ability a 100% chance to reduce the target's attack speed by 15% for 5 seconds."]],"arrows":[],"icon":"ability_rogue_trip"},"Trap Mastery":{"name":"Trap Mastery","pos":"c1","maxRank":2,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Decreases the chance enemies will resist trap effects by 5%, reduces the cooldown of all traps by 25%, and increases the damage of Immolation and Explosive trap effects by 15%.","Decreases the chance enemies will resist trap effects by 10%, reduces the cooldown of all traps by 50%, and increases the damage of Immolation and Explosive trap effects by 30%."]],"arrows":[],"icon":"ability_ensnare"},"Survivalist":{"name":"Survivalist","pos":"c2","maxRank":5,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases total health by 4%.","Increases total health by 8%.","Increases total health by 12%.","Increases total health by 16%.","Increases total health by 20%."]],"arrows":[],"icon":"spell_shadow_twilight"},"Deterrence":{"name":"Deterrence","pos":"c3","maxRank":1,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"5 minutes cooldown","descriptions":[["When activated, increases your Dodge and Parry chance by 25% for 10 seconds."]],"arrows":[],"icon":"ability_whirlwind"},"Trapper's Net":{"name":"Trapper's Net","pos":"d1","maxRank":1,"reqPoints":15,"prereq":"Trap Mastery","dependencyName":"","cost":"","cooldown":"30 seconds cooldown","descriptions":[["The Hunter casts his net at the target area. If an enemy is struck, they will be ensnared for 5 seconds and pulled to the Hunter if able. The enemy will be forced to attack the Hunter for the duration of the ensnare."]],"arrows":[{"to":"d1","dir":"down","from":"c1"}],"icon":"inv_misc_wartornscrap_chain"},"Surefooted":{"name":"Surefooted","pos":"d2","maxRank":3,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases hit chance by 1% and increases the chance movement impairing effects will be resisted by an additional 5%.","Increases hit chance by 2% and increases the chance movement impairing effects will be resisted by an additional 10%.","Increases hit chance by 3% and increases the chance movement impairing effects will be resisted by an additional 15%."]],"arrows":[],"icon":"ability_kick"},"Dangerous Game":{"name":"Dangerous Game","pos":"d4","maxRank":2,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the cooldown of your Feign Death ability by 10 sec, and the chance it will be resisted by 8%.","Reduces the cooldown of your Feign Death ability by 15 sec, and the chance it will be resisted by 16%."]],"arrows":[],"icon":"ability_rogue_feigndeath"},"Killer Instinct":{"name":"Killer Instinct","pos":"e2","maxRank":3,"reqPoints":20,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your critical strike chance with all attacks by 1%.","Increases your critical strike chance with all attacks by 2%.","Increases your critical strike chance with all attacks by 3%."]],"arrows":[],"icon":"spell_holy_blessingofstamina"},"Disengage":{"name":"Disengage","pos":"e3","maxRank":1,"reqPoints":20,"prereq":"Deterrence","dependencyName":"","cost":"100 Mana","cooldown":"30 seconds cooldown","descriptions":[["Attempts to disengage from the target, vaulting backwards. Reduces threat by a large amount. Character exits combat mode."]],"arrows":[{"to":"e3","dir":"down","from":"c3"}],"icon":"ability_rogue_feint"},"Lightning Reflexes":{"name":"Lightning Reflexes","pos":"f3","maxRank":5,"reqPoints":25,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your Agility by 4%.","Increases your Agility by 8%.","Increases your Agility by 12%.","Increases your Agility by 16%.","Increases your Agility by 20%."]],"arrows":[],"icon":"spell_nature_invisibilty"},"Primal Hunter":{"name":"Primal Hunter","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Killer Instinct","dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the range of your melee attacks and abilities while wielding a Polearm or Staff by 5 yards, and causes your thrown attacks to apply Lacerate to the enemy, increasing damage taken by 1%. Stacks up to 5 times."]],"arrows":[{"to":"g2","dir":"down","from":"e2"}],"icon":"inv_spear_03"}}}}