{"Arcane":{"name":"Arcane","background":"arcane","icon":"","talents":{"Wand Specialization":{"name":"Wand Specialization","pos":"a1","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases your damage with Wands by 25%.","Increases your damage with Wands by 50%."],"icon":"inv_wand_01"},"Arcane Focus":{"name":"Arcane Focus","pos":"a2","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Reduces the chance that the opponent can resist your Arcane spells by 1% and gives you a 20% chance to avoid interruption caused by damage while channeling Arcane Missiles.","Reduces the chance that the opponent can resist your Arcane spells by 2% and gives you a 40% chance to avoid interruption caused by damage while channeling Arcane Missiles.","Reduces the chance that the opponent can resist your Arcane spells by 3% and gives you a 60% chance to avoid interruption caused by damage while channeling Arcane Missiles.","Reduces the chance that the opponent can resist your Arcane spells by 4% and gives you a 80% chance to avoid interruption caused by damage while channeling Arcane Missiles.","Reduces the chance that the opponent can resist your Arcane spells by 5% and gives you a 100% chance to avoid interruption caused by damage while channeling Arcane Missiles."],"icon":"spell_holy_devotion"},"Elemental Precision":{"name":"Elemental Precision","pos":"a3","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Reduces the chance that the opponent can resist your Frost and Fire spells by 1%.","Reduces the chance that the opponent can resist your Frost and Fire spells by 2%.","Reduces the chance that the opponent can resist your Frost and Fire spells by 3%."],"icon":"spell_ice_magicdamage"},"Arcane Resilience":{"name":"Arcane Resilience","pos":"c1","maxRank":3,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases your armor by an amount equal to 50% of your Intellect and increases the effects of your Mage Armor by 10%.","Increases your armor by an amount equal to 100% of your Intellect and increases the effects of your Mage Armor by 20%.","Increases your armor by an amount equal to 150% of your Intellect and increases the effects of your Mage Armor by 30%."],"icon":"spell_arcane_arcaneresilience"},"Practical Defensive Magic":{"name":"Practical Defensive Magic","pos":"b1","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the effect of your Amplify Magic and Dampen Magic spells by 25%, decreases the mana lost per point of damage taken when Mana Shield is active by 25%, and gives your Polymorph a 45% chance to not lose casting time when you take damage.","Increases the effect of your Amplify Magic and Dampen Magic spells by 50%, decreases the mana lost per point of damage taken when Mana Shield is active by 50%, and gives your Polymorph a 90% chance to not lose casting time when you take damage."],"icon":"spell_shadow_detectlesserinvisibility"},"Magic Absorption":{"name":"Magic Absorption","pos":"b2","maxRank":5,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases all resistances by 5 and causes all spells you fully resist to restore 1% of your total mana.  1 sec. cooldown.","Increases all resistances by 10 and causes all spells you fully resist to restore 2% of your total mana.  1 sec. cooldown.","Increases all resistances by 15 and causes all spells you fully resist to restore 3% of your total mana.  1 sec. cooldown.","Increases all resistances by 20 and causes all spells you fully resist to restore 4% of your total mana.  1 sec. cooldown.","Increases all resistances by 25 and causes all spells you fully resist to restore 5% of your total mana.  1 sec. cooldown."],"icon":"spell_nature_astralrecalgroup"},"Master of Elements":{"name":"Master of Elements","pos":"b3","maxRank":3,"reqPoints":5,"prereq":"Elemental Precision","cost":"","cooldown":"","descriptions":["Your Fire and Frost spell criticals will refund 10% of their base mana cost.","Your Fire and Frost spell criticals will refund 20% of their base mana cost.","Your Fire and Frost spell criticals will refund 30% of their base mana cost."],"icon":"spell_fire_masterofelements"},"Arcane Subtlety":{"name":"Arcane Subtlety","pos":"a4","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Reduces your target's resistance to all your spells by 5 and reduces the threat caused by your Arcane spells by 25%.","Reduces your target's resistance to all your spells by 10 and reduces the threat caused by your Arcane spells by 50%."],"icon":"spell_holy_dispelmagic"},"Arcane Concentration":{"name":"Arcane Concentration","pos":"c2","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Gives you a 2% chance of entering a Clearcasting state after any damage spell cast.  The Clearcasting state reduces the mana cost of your next spell by 100%.","Gives you a 4% chance of entering a Clearcasting state after any damage spell cast.  The Clearcasting state reduces the mana cost of your next spell by 100%.","Gives you a 6% chance of entering a Clearcasting state after any damage spell cast.  The Clearcasting state reduces the mana cost of your next spell by 100%.","Gives you a 8% chance of entering a Clearcasting state after any damage spell cast.  The Clearcasting state reduces the mana cost of your next spell by 100%.","Gives you a 10% chance of entering a Clearcasting state after any damage spell cast.  The Clearcasting state reduces the mana cost of your next spell by 100%."],"icon":"spell_shadow_manaburn"},"Spell Twisting":{"name":"Spell Twisting","pos":"c3","maxRank":1,"reqPoints":10,"prereq":"Master of Elements","cost":"","cooldown":"","descriptions":["Your Fire combat spells increases your chance to get a critical strike chance with your next Frost damage spell by 15%.\n\nYour Frost combat spells increases your chance to get a critical strike chance with your next Fire damage spell by 15%.\n\nYour Arcane combat spells increases your chance to get a critical strike chance with your next  Fire or Frost damage spell by 15%."],"icon":"spell_fireresistancetotem_01"},"Practical Offensive Magic":{"name":"Practical Offensive Magic","pos":"d1","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Gives your Counterspell a 50% chance to silence the target for 6 seconds, reduces the cooldown of your Counterspell and Blink spells by 10%, and increases the radius of your Arcane Explosion by 1 yards.","Gives your Counterspell a 100% chance to silence the target for 6 seconds, reduces the cooldown of your Counterspell and Blink spells by 20%, and increases the radius of your Arcane Explosion by 2 yards."],"icon":"arcane_magic"},"Arcane Instability":{"name":"Arcane Instability","pos":"d2","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases your spell damage and critical strike chance by 1%.","Increases your spell damage and critical strike chance by 2%.","Increases your spell damage and critical strike chance by 3%.","Increases your spell damage and critical strike chance by 4%.","Increases your spell damage and critical strike chance by 5%."],"icon":"spell_shadow_teleport"},"Arcane Meditation":{"name":"Arcane Meditation","pos":"d3","maxRank":3,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Allows 10% of your Mana regeneration to continue while casting.","Allows 20% of your Mana regeneration to continue while casting.","Allows 30% of your Mana regeneration to continue while casting."],"icon":"spell_shadow_siphonmana"},"Arcane Power":{"name":"Arcane Power","pos":"e2","maxRank":1,"reqPoints":20,"prereq":"Arcane Instability","cost":"","cooldown":"5 minutes cooldown","descriptions":["When activated, your spells deal 30% more damage while costing 30% more mana to cast.  This effect lasts 15 seconds."],"icon":"spell_nature_lightning"},"Arcane Wrath":{"name":"Arcane Wrath","pos":"e3","maxRank":2,"reqPoints":20,"prereq":"Arcane Power","cost":"","cooldown":"","descriptions":["Increases the critical strike damage bonus of your Arcane spells by 50%.","Increases the critical strike damage bonus of your Arcane spells by 100%."],"icon":"spell_arcane_arcanetorrent"},"Arcane Mind":{"name":"Arcane Mind","pos":"e4","maxRank":5,"reqPoints":20,"prereq":"Arcane Meditation","cost":"","cooldown":"","descriptions":["Increases your total Intellect by 3%.","Increases your total Intellect by 6%.","Increases your total Intellect by 9%.","Increases your total Intellect by 12%.","Increases your total Intellect by 15%."],"icon":"spell_shadow_charm"},"Time Pressure":{"name":"Time Pressure","pos":"f1","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Increases the casting speed by 4%.","Increases the casting speed by 8%.","Increases the casting speed by 12%.","Increases the casting speed by 16%.","Increases the casting speed by 20%."],"icon":"inv_misc_pocketwatch_01"},"Improved Arcane Power":{"name":"Improved Arcane Power","pos":"f2","maxRank":2,"reqPoints":25,"prereq":"Arcane Power","cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Arcane Power by 1 min and increases duration by 3 secs.","Reduces the cooldown of your Arcane Power by 2 min and increases duration by 5 secs."],"icon":"spell_nature_wispheal"},"Mind Mastery":{"name":"Mind Mastery","pos":"f3","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Increases spell damage by up to 5% of your total Intellect and increases the effect of your Arcane Intellect by 20%.","Increases spell damage by up to 10% of your total Intellect and increases the effect of your Arcane Intellect by 40%.","Increases spell damage by up to 15% of your total Intellect and increases the effect of your Arcane Intellect by 60%.","Increases spell damage by up to 20% of your total Intellect and increases the effect of your Arcane Intellect by 80%.","Increases spell damage by up to 25% of your total Intellect and increases the effect of your Arcane Intellect by 100%."],"icon":"spell_arcane_mindmastery"},"Brilliance Aura":{"name":"Brilliance Aura","pos":"g2","maxRank":1,"reqPoints":30,"cost":"","cooldown":"","descriptions":["Generates 1% of total Mana every undefined sec to all party members within 30 yds."],"icon":"spell_nature_brilliance"}}}}