{"Arcane":{"name":"Arcane","background":"arcane","icon":"","talents":{"Arcane Subtlety":{"name":"Arcane Subtlety","pos":"a1","maxRank":2,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces your target's resistance to all your spells by 5 and reduces the threat caused by your Arcane spells by 20%.","Reduces your target's resistance to all your spells by 10 and reduces the threat caused by your Arcane spells by 40%."]],"arrows":[],"icon":"spell_holy_dispelmagic"},"Arcane Focus":{"name":"Arcane Focus","pos":"a2","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the chance that the opponent can resist your Arcane spells by 2%.","Reduces the chance that the opponent can resist your Arcane spells by 4%.","Reduces the chance that the opponent can resist your Arcane spells by 6%.","Reduces the chance that the opponent can resist your Arcane spells by 8%.","Reduces the chance that the opponent can resist your Arcane spells by 10%."]],"arrows":[],"icon":"spell_holy_devotion"},"Arcane Channeling":{"name":"Arcane Channeling","pos":"a3","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives you a 20% chance to avoid interruption caused by damage while channeling Arcane Missiles.","Gives you a 40% chance to avoid interruption caused by damage while channeling Arcane Missiles.","Gives you a 60% chance to avoid interruption caused by damage while channeling Arcane Missiles.","Gives you a 80% chance to avoid interruption caused by damage while channeling Arcane Missiles.","Gives you a 100% chance to avoid interruption caused by damage while channeling Arcane Missiles."]],"arrows":[],"icon":"spell_nature_starfall"},"Wizardry":{"name":"Wizardry","pos":"b1","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your damage with Wands by 25%, grants 25% spellpower bonus to your wand attacks, and reduces the casting time of your Polymorph, Teleport, Portal, Invisibility, Conjure Food and Water spells by 25%.","Increases your damage with Wands by 50%, grants 50% spellpower bonus to your wand attacks, and reduces the casting time of your Polymorph, Teleport, Portal, Invisibility, Conjure Food and Water spells by 50%."]],"arrows":[],"icon":"inv_wand_01"},"Magic Absorption":{"name":"Magic Absorption","pos":"b2","maxRank":5,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases all resistances by 5 and causes all spells you fully resist to restore 2% of your total mana.  1 sec. cooldown.","Increases all resistances by 10 and causes all spells you fully resist to restore 4% of your total mana.  1 sec. cooldown.","Increases all resistances by 15 and causes all spells you fully resist to restore 6% of your total mana.  1 sec. cooldown.","Increases all resistances by 20 and causes all spells you fully resist to restore 8% of your total mana.  1 sec. cooldown.","Increases all resistances by 25 and causes all spells you fully resist to restore 10% of your total mana.  1 sec. cooldown."]],"arrows":[],"icon":"spell_nature_astralrecalgroup"},"Arcane Concentration":{"name":"Arcane Concentration","pos":"b3","maxRank":5,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives you a 4% chance of entering a Clearcasting state after any damage spell hits a target.  The Clearcasting state reduces the mana cost of your next damage spell by 100%.","Gives you a 8% chance of entering a Clearcasting state after any damage spell hits a target.  The Clearcasting state reduces the mana cost of your next damage spell by 100%.","Gives you a 12% chance of entering a Clearcasting state after any damage spell hits a target.  The Clearcasting state reduces the mana cost of your next damage spell by 100%.","Gives you a 16% chance of entering a Clearcasting state after any damage spell hits a target.  The Clearcasting state reduces the mana cost of your next damage spell by 100%.","Gives you a 20% chance of entering a Clearcasting state after any damage spell hits a target.  The Clearcasting state reduces the mana cost of your next damage spell by 100%."]],"arrows":[],"icon":"spell_shadow_manaburn"},"Magic Attunement":{"name":"Magic Attunement","pos":"c1","maxRank":2,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the effect of your Amplify Magic, Dampen Magic, Arcane Intellect and Arcane Brilliance spells by 25%, and reduces their mana costs by 25%.","Increases the effect of your Amplify Magic, Dampen Magic, Arcane Intellect and Arcane Brilliance spells by 50%, and reduces their mana costs by 50%."]],"arrows":[],"icon":"spell_nature_abolishmagic"},"Arcane Flux":{"name":"Arcane Flux","pos":"c2","maxRank":3,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the critical strike chance of your Arcane Explosion spell by an additional 10%, but increases the casting time by 0.5 sec.","Increases the critical strike chance of your Arcane Explosion spell by an additional 20%, but increases the casting time by 1 sec.","Increases the critical strike chance of your Arcane Explosion spell by an additional 30%, but increases the casting time by 1.5 sec."]],"arrows":[],"icon":"spell_nature_wispsplode"},"Arcane Resilience":{"name":"Arcane Resilience","pos":"c3","maxRank":5,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your armor by an amount equal to 50% of your Intellect.","Increases your armor by an amount equal to 100% of your Intellect.","Increases your armor by an amount equal to 150% of your Intellect.","Increases your armor by an amount equal to 200% of your Intellect.","Increases your armor by an amount equal to 250% of your Intellect."]],"arrows":[],"icon":"spell_arcane_arcaneresilience"},"Energy Wall":{"name":"Energy Wall","pos":"d1","maxRank":2,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the damage absorbed and decreases the mana lost per point of damage taken when Mana Shield is active by 25%.","Increases the damage absorbed and decreases the mana lost per point of damage taken when Mana Shield is active by 50%."]],"arrows":[],"icon":"spell_shadow_detectlesserinvisibility"},"Nullify":{"name":"Nullify","pos":"d2","maxRank":1,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Your Counterspell silences the target for 4 seconds."]],"arrows":[],"icon":"spell_frost_iceshock"},"Arcane Meditation":{"name":"Arcane Meditation","pos":"d4","maxRank":3,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Allows 10% of your Mana regeneration to continue while casting.","Allows 20% of your Mana regeneration to continue while casting.","Allows 30% of your Mana regeneration to continue while casting."]],"arrows":[],"icon":"spell_shadow_siphonmana"},"Presence of Mind":{"name":"Presence of Mind","pos":"e2","maxRank":1,"reqPoints":20,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Each successful Arcane Missile impact grants Presence of Mind to the Mage, reducing the casting time of their next spell by 0.3 sec per charge. Stacks up to 20 times."]],"arrows":[],"icon":"spell_nature_enchantarmor"},"Time Warp":{"name":"Time Warp","pos":"e3","maxRank":1,"reqPoints":20,"prereq":"Arcane Resilience","dependencyName":"","cost":"","cooldown":"","descriptions":[["The cooldown of Blink is reset whenever you are struck by physical damage while Mage Armor is active."]],"arrows":[{"to":"e3","dir":"down","from":"c3"}],"icon":"vas_charactertransfer"},"Arcane Instability":{"name":"Arcane Instability","pos":"f2","maxRank":3,"reqPoints":25,"prereq":"Presence of Mind","dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your spell damage and critical strike chance by 1%, and the critical strike damage bonus of your Arcane spells by 33%.","Increases your spell damage and critical strike chance by 2%, and the critical strike damage bonus of your Arcane spells by 65%.","Increases your spell damage and critical strike chance by 3%, and the critical strike damage bonus of your Arcane spells by 100%."]],"arrows":[{"to":"f2","dir":"down","from":"e2"}],"icon":"spell_shadow_teleport"},"Arcane Power":{"name":"Arcane Power","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Arcane Instability","dependencyName":"","cost":"","cooldown":"3 minutes cooldown","descriptions":[["When activated, your spells deal 30% more damage while costing 30% more mana to cast.  This effect lasts 15 seconds."]],"arrows":[{"to":"g2","dir":"down","from":"f2"}],"icon":"spell_nature_lightning"}}}}