{"Fire":{"name":"Fire","background":"fire","icon":"","talents":{"Fire Warding":{"name":"Fire Warding","pos":"a1","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases your Fire resistance by 10. In addition, causes your Fire Ward to have a 15% chance to reflect Fire spells while active.","Increases your Fire resistance by 20. In addition, causes your Fire Ward to have a 30% chance to reflect Fire spells while active."],"icon":"spell_fire_firearmor"},"Improved Fireball":{"name":"Improved Fireball","pos":"a2","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Reduces the casting time of your Fireball spell by 0.1 sec.","Reduces the casting time of your Fireball spell by 0.2 sec.","Reduces the casting time of your Fireball spell by 0.3 sec.","Reduces the casting time of your Fireball spell by 0.4 sec.","Reduces the casting time of your Fireball spell by 0.5 sec."],"icon":"spell_fire_flamebolt"},"Improved Fire Blast":{"name":"Improved Fire Blast","pos":"a3","maxRank":4,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Fire Blast spell by 2.5 sec.","Reduces the cooldown of your Fire Blast spell by 5 sec.","Reduces the cooldown of your Fire Blast spell by 7.5 sec.","Reduces the cooldown of your Fire Blast spell by 10 sec."],"icon":"spell_fire_fireball"},"Pyroblast":{"name":"Pyroblast","pos":"a4","maxRank":1,"reqPoints":0,"prereq":"Improved Fire Blast","cost":"105 mana","cooldown":"1 minute cooldown","descriptions":["Hurls an immense fiery boulder that causes 120 Fire damage and an additional undefined2 Fire damage over 12 seconds."],"icon":"spell_fire_fireball02"},"Flame Throwing":{"name":"Flame Throwing","pos":"b1","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the range and the radius of your Fire spells by 10%.","Increases the range and the radius of your Fire spells by 20%."],"icon":"spell_fire_flare"},"Burning Soul":{"name":"Burning Soul","pos":"b2","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Gives your Fire spells a 25% chance to not lose casting time when you take damage and reduces the threat caused by your Fire spells by 5%.","Gives your Fire spells a 50% chance to not lose casting time when you take damage and reduces the threat caused by your Fire spells by 10%.","Gives your Fire spells a 75% chance to not lose casting time when you take damage and reduces the threat caused by your Fire spells by 15%."],"icon":"spell_fire_fire"},"Impact":{"name":"Impact","pos":"b3","maxRank":5,"reqPoints":5,"prereq":"Improved Fire Blast","cost":"","cooldown":"","descriptions":["Gives your Fire spells a 4% chance to stun the target for 2 seconds.","Gives your Fire spells a 8% chance to stun the target for 2 seconds.","Gives your Fire spells a 12% chance to stun the target for 2 seconds.","Gives your Fire spells a 16% chance to stun the target for 2 seconds.","Gives your Fire spells a 20% chance to stun the target for 2 seconds."],"icon":"spell_fire_meteorstorm"},"Critical Mass":{"name":"Critical Mass","pos":"c1","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the critical strike chance of your Fire spells by 1%.","Increases the critical strike chance of your Fire spells by 2%.","Increases the critical strike chance of your Fire spells by 3%.","Increases the critical strike chance of your Fire spells by 4%.","Increases the critical strike chance of your Fire spells by 5%."],"icon":"inv_summerfest_firepotion"},"Blast Wave":{"name":"Blast Wave","pos":"c2","maxRank":1,"reqPoints":10,"cost":"135 mana","cooldown":"1 minute cooldown","descriptions":["A wave of flame radiates outward from the caster, damaging all enemies caught within the blast for 96 Fire damage and dazing them for 6 seconds."],"icon":"spell_holy_excorcism_02"},"Incinerate":{"name":"Incinerate","pos":"c4","maxRank":3,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the critical strike chance of your Fire Blast, Scorch, Flamestrike and Blast Wave spells by 3%.","Increases the critical strike chance of your Fire Blast, Scorch, Flamestrike and Blast Wave spells by 6%.","Increases the critical strike chance of your Fire Blast, Scorch, Flamestrike and Blast Wave spells by 9%."],"icon":"spell_fire_flameshock"},"Blazing Speed":{"name":"Blazing Speed","pos":"d2","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases movement and mounted movement speed by 5%.  This does not stack with other movement speed increasing effects.\nIn addition, gives you a 5% chance when hit by a melee or ranged attack to increase your movement and casting speed by 50% for 5 seconds and dispel all movement impairing effects.","Increases movement and mounted movement speed by 10%.  This does not stack with other movement speed increasing effects.\nIn addition, gives you a 10% chance when hit by a melee or ranged attack to increase your movement and casting speed by 50% for 5 seconds and dispel all movement impairing effects."],"icon":"ability_rogue_sprint"},"Hot Streak":{"name":"Hot Streak","pos":"d4","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Your Fire damage spell crits have an 3% chance to make your next Scorch or Pyroblast spell cast instantly and cost no mana.","Your Fire damage spell crits have an 6% chance to make your next Scorch or Pyroblast spell cast instantly and cost no mana.","Your Fire damage spell crits have an 9% chance to make your next Scorch or Pyroblast spell cast instantly and cost no mana.","Your Fire damage spell crits have an 12% chance to make your next Scorch or Pyroblast spell cast instantly and cost no mana.","Your Fire damage spell crits have an 15% chance to make your next Scorch or Pyroblast spell cast instantly and cost no mana."],"icon":"incinerate_war3"},"Chain Reaction":{"name":"Chain Reaction","pos":"e1","maxRank":1,"reqPoints":20,"prereq":"Critical Mass","cost":"50 mana","cooldown":"20 seconds cooldown","descriptions":["While active, your Fire spells strike an additional nearby target. Maintaining this effect may harm your body and soul."],"icon":"spell_fire_moltenblood"},"Overheat":{"name":"Overheat","pos":"e2","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Improves your chance to get a critical strike with spells by 2%, but increases the threat generated by your critical hits by 10%.","Improves your chance to get a critical strike with spells by 4%, but increases the threat generated by your critical hits by 20%.","Improves your chance to get a critical strike with spells by 6%, but increases the threat generated by your critical hits by 30%."],"icon":"spell_frost_fireresistancetotem"},"Thermal Expansion":{"name":"Thermal Expansion","pos":"e3","maxRank":1,"reqPoints":20,"prereq":"Blast Wave","cost":"","cooldown":"","descriptions":["Generates mana equal to your level every 2 sec."],"icon":"inv_elemental_primal_fire"},"Improved Scorch":{"name":"Improved Scorch","pos":"e4","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Your Scorch spells have a 33% chance to cause your target to be vulnerable to Fire damage.  This vulnerability increases the Fire damage dealt to your target by 2% and lasts 15 seconds.  Stacks up to undefined times.","Your Scorch spells have a 66% chance to cause your target to be vulnerable to Fire damage.  This vulnerability increases the Fire damage dealt to your target by 2% and lasts 15 seconds.  Stacks up to undefined times.","Your Scorch spells have a 100% chance to cause your target to be vulnerable to Fire damage.  This vulnerability increases the Fire damage dealt to your target by 2% and lasts 15 seconds.  Stacks up to undefined times."],"icon":"spell_fire_soulburn"},"Ignite":{"name":"Ignite","pos":"f1","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Your critical strikes from Fire damage spells cause the target to burn for an additional 8% of your spell's damage over 8 seconds.","Your critical strikes from Fire damage spells cause the target to burn for an additional 16% of your spell's damage over 8 seconds.","Your critical strikes from Fire damage spells cause the target to burn for an additional 24% of your spell's damage over 8 seconds.","Your critical strikes from Fire damage spells cause the target to burn for an additional 32% of your spell's damage over 8 seconds.","Your critical strikes from Fire damage spells cause the target to burn for an additional 40% of your spell's damage over 8 seconds."],"icon":"spell_fire_incinerate"},"Fire Power":{"name":"Fire Power","pos":"f3","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Increases the damage done by your Fire spells by 2%.","Increases the damage done by your Fire spells by 4%.","Increases the damage done by your Fire spells by 6%.","Increases the damage done by your Fire spells by 8%.","Increases the damage done by your Fire spells by 10%."],"icon":"spell_fire_immolation"},"Pyromania":{"name":"Pyromania","pos":"f4","maxRank":2,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Reduces the casting time of your Fireball and Pyroblast spells by 3%, and your Flamestrike spell by 50%.\nIn addition, reduces the cooldown of your Blast Wave spell by 15 sec.","Reduces the casting time of your Fireball and Pyroblast spells by 5%, and your Flamestrike spell by 100%.\nIn addition, reduces the cooldown of your Blast Wave spell by 30 sec."],"icon":"inv_torch_lit"},"Combustion":{"name":"Combustion","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Overheat","cost":"","cooldown":"2 minutes cooldown","descriptions":["When activated, this spell causes each of your Fire damage spell hits to increase your critical strike chance with Fire damage spells by 10%.  This effect lasts until you have caused undefined critical strikes with Fire spells."],"icon":"spell_fire_sealoffire"}}}}