{"Frost":{"name":"Frost","background":"frost","icon":"","talents":{"Frost Warding":{"name":"Frost Warding","pos":"a1","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the armor and resistances given by your Frost Armor and Ice Armor spells by 15%.  In addition, gives your Frost Ward a 15% chance to reflect Frost spells and effects while active.","Increases the armor and resistances given by your Frost Armor and Ice Armor spells by 30%.  In addition, gives your Frost Ward a 30% chance to reflect Frost spells and effects while active."],"icon":"spell_frost_frostward"},"Improved Frostbolt":{"name":"Improved Frostbolt","pos":"a2","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Reduces the casting time of your Frostbolt spell by 0.1 sec.","Reduces the casting time of your Frostbolt spell by 0.2 sec.","Reduces the casting time of your Frostbolt spell by 0.3 sec.","Reduces the casting time of your Frostbolt spell by 0.4 sec.","Reduces the casting time of your Frostbolt spell by 0.5 sec."],"icon":"spell_frost_frostbolt02"},"Permafrost":{"name":"Permafrost","pos":"a3","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the duration of your Chill effects by 1 secs and reduces the target's speed by an additional 4%.","Increases the duration of your Chill effects by 2 secs and reduces the target's speed by an additional 7%.","Increases the duration of your Chill effects by 3 secs and reduces the target's speed by an additional 10%."],"icon":"spell_frost_wisp"},"Cryo Core":{"name":"Cryo Core","pos":"b1","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces all spell damage taken by 5%, but increases physical damage taken by 3%.","Reduces all spell damage taken by 10%, but increases physical damage taken by 6%.","Reduces all spell damage taken by 15%, but increases physical damage taken by 9%."],"icon":"ice_shard"},"Frostbite":{"name":"Frostbite","pos":"b2","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Gives your Chill effects a 5% chance to freeze the target for 5 seconds.","Gives your Chill effects a 10% chance to freeze the target for 5 seconds.","Gives your Chill effects a 15% chance to freeze the target for 5 seconds."],"icon":"spell_frost_frostarmor"},"Improved Frost Nova":{"name":"Improved Frost Nova","pos":"b3","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Frost Nova spell by 5 sec.","Reduces the cooldown of your Frost Nova spell by 10 sec."],"icon":"spell_frost_freezingbreath"},"Frost Channeling":{"name":"Frost Channeling","pos":"c4","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Reduces the mana cost of your Frost spells by 3% and reduces the threat caused by your Frost spells by 6%.","Reduces the mana cost of your Frost spells by 6% and reduces the threat caused by your Frost spells by 12%.","Reduces the mana cost of your Frost spells by 9% and reduces the threat caused by your Frost spells by 18%.","Reduces the mana cost of your Frost spells by 12% and reduces the threat caused by your Frost spells by 24%.","Reduces the mana cost of your Frost spells by 15% and reduces the threat caused by your Frost spells by 30%."],"icon":"spell_frost_stun"},"Ice Block":{"name":"Ice Block","pos":"c1","maxRank":1,"reqPoints":10,"prereq":"Cryo Core","cost":"20% Base Mana","cooldown":"10 minutes cooldown","descriptions":["You become encased in a block of ice, protecting you from all physical attacks and spells for 10 seconds, but during that time you cannot attack, move or cast spells."],"icon":"spell_frost_frost"},"Arctic Reach":{"name":"Arctic Reach","pos":"c2","maxRank":2,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the range and the radius of your Frost spells by 10%.","Increases the range and the radius of your Frost spells by 20%."],"icon":"spell_shadow_darkritual"},"Cold Grip":{"name":"Cold Grip","pos":"d4","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the damage dealt by your Cone of Cold and Ice Shards by 15% and reduces the cooldown of Cone of Cold and Cold Snap by 25%. In addition, your Blizzard spell chills targets, reducing their movement speed by 25% for 2 seconds.","Increases the damage dealt by your Cone of Cold and Ice Shards by 30% and reduces the cooldown of Cone of Cold and Cold Snap by 50%. In addition, your Blizzard spell chills targets, reducing their movement speed by 50% for 2 seconds."],"icon":"spell_frost_glacier"},"Frost Shards":{"name":"Frost Shards","pos":"d2","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the critical strike damage bonus of your Frost spells by 20%.","Increases the critical strike damage bonus of your Frost spells by 40%.","Increases the critical strike damage bonus of your Frost spells by 60%.","Increases the critical strike damage bonus of your Frost spells by 80%.","Increases the critical strike damage bonus of your Frost spells by 100%."],"icon":"spell_frost_iceshard"},"Shatter":{"name":"Shatter","pos":"d3","maxRank":3,"reqPoints":15,"prereq":"Improved Frost Nova","cost":"","cooldown":"","descriptions":["Increases the critical strike chance of all your spells against frozen targets by 10%.","Increases the critical strike chance of all your spells against frozen targets by 20%.","Increases the critical strike chance of all your spells against frozen targets by 30%."],"icon":"spell_frost_frostshock"},"Cold Blood":{"name":"Cold Blood","pos":"b4","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases your chance to resist Silence and Interrupt effects by an additional 10%.","Increases your chance to resist Silence and Interrupt effects by an additional 20%.","Increases your chance to resist Silence and Interrupt effects by an additional 30%."],"icon":"inv_misc_rune_09"},"Ice Mirror":{"name":"Ice Mirror","pos":"e1","maxRank":1,"reqPoints":20,"prereq":"Ice Block","cost":"25% Base Mana","cooldown":"1 minute cooldown","descriptions":["Protects the friendly target with a mirror of ice. The mirror reflects spells casts for 5 seconds."],"icon":"inv_jewelcrafting_icediamond_02"},"Ice Shards":{"name":"Ice Shards","pos":"e2","maxRank":1,"reqPoints":20,"prereq":"Frost Shards","cost":"30% Base Mana","cooldown":"","descriptions":["Launches four shards of ice at the enemy, each dealing Frost damage equal to your level and slowing movement speed by 20% for 2 seconds."],"icon":"spell_frost_frostbolt"},"Icing":{"name":"Icing","pos":"e3","maxRank":5,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Regenerates 0% of your health and mana every NaN sec if you've been standing still for ~10 sec.","Regenerates 0% of your health and mana every NaN sec if you've been standing still for ~10 sec.","Regenerates 0% of your health and mana every NaN sec if you've been standing still for ~10 sec.","Regenerates 0% of your health and mana every NaN sec if you've been standing still for ~10 sec.","Regenerates 0% of your health and mana every NaN sec if you've been standing still for ~10 sec."],"icon":"ability_mage_coldasice"},"Lord of the North Wind":{"name":"Lord of the North Wind","pos":"f2","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Increases the critical strike chance of your Frost spells by 2% and the chance you are hit by melee and ranged attacks reduced by 1%.","Increases the critical strike chance of your Frost spells by 4% and the chance you are hit by melee and ranged attacks reduced by 2%.","Increases the critical strike chance of your Frost spells by 6% and the chance you are hit by melee and ranged attacks reduced by 3%.","Increases the critical strike chance of your Frost spells by 8% and the chance you are hit by melee and ranged attacks reduced by 4%.","Increases the critical strike chance of your Frost spells by 10% and the chance you are hit by melee and ranged attacks reduced by 5%."],"icon":"spell_frost_manarecharge"},"Winter's Chill":{"name":"Winter's Chill","pos":"f3","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Gives your Frost damage spells a 20% chance to apply the Winter's Chill effect, which increases the chance a Frost spell will critically hit the target by 2% for 15 seconds.  Stacks up to 10 times.","Gives your Frost damage spells a 40% chance to apply the Winter's Chill effect, which increases the chance a Frost spell will critically hit the target by 2% for 15 seconds.  Stacks up to 10 times.","Gives your Frost damage spells a 60% chance to apply the Winter's Chill effect, which increases the chance a Frost spell will critically hit the target by 2% for 15 seconds.  Stacks up to 10 times.","Gives your Frost damage spells a 80% chance to apply the Winter's Chill effect, which increases the chance a Frost spell will critically hit the target by 2% for 15 seconds.  Stacks up to 10 times.","Gives your Frost damage spells a 100% chance to apply the Winter's Chill effect, which increases the chance a Frost spell will critically hit the target by 2% for 15 seconds.  Stacks up to 10 times."],"icon":"spell_frost_chillingblast"},"Ice Barrier":{"name":"Ice Barrier","pos":"g2","maxRank":1,"reqPoints":30,"cost":"305 Mana","cooldown":"1 minute cooldown","descriptions":["Instantly shields a friendly target, absorbing 548 damage.  Lasts 1 minute.  While the shield holds, spells will not be interrupted."],"icon":"spell_ice_lament"},"Advanced Ice Shielding":{"name":"Advanced Ice Shielding","pos":"g3","maxRank":2,"reqPoints":30,"prereq":"Ice Barrier","cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Ice Barrier, Ice Block and Ice Mirror spells by 25%, reduces their Mana cost by 10% and reduces the chance your Ice Barrier will be dispelled by 50%.","Reduces the cooldown of your Ice Barrier, Ice Block and Ice Mirror spells by 50%, reduces their Mana cost by 20% and reduces the chance your Ice Barrier will be dispelled by 100%."],"icon":"spell_ice_lament"}}}}