{"Protection":{"name":"Protection","background":"protection","icon":"","talents":{"Toughness":{"name":"Toughness","pos":"a2","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your armor value from items by 4%.","Increases your armor value from items by 8%.","Increases your armor value from items by 12%.","Increases your armor value from items by 16%.","Increases your armor value from items by 20%."]],"arrows":[],"icon":"spell_holy_devotion"},"Redoubt":{"name":"Redoubt","pos":"a3","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your chance to block attacks with your shield or buckler by 5% while standing within Consecration.","Increases your chance to block attacks with your shield or buckler by 10% while standing within Consecration.","Increases your chance to block attacks with your shield or buckler by 15% while standing within Consecration.","Increases your chance to block attacks with your shield or buckler by 20% while standing within Consecration.","Increases your chance to block attacks with your shield or buckler by 25% while standing within Consecration."]],"arrows":[],"icon":"ability_defend"},"Vindication":{"name":"Vindication","pos":"b1","maxRank":3,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Causes the Paladin's damaging melee attacks to reduce the target's attack speed by 5% for 10 seconds.","Causes the Paladin's damaging melee attacks to reduce the target's attack speed by 10% for 10 seconds.","Causes the Paladin's damaging melee attacks to reduce the target's attack speed by 15% for 10 seconds."]],"arrows":[],"icon":"spell_holy_vindication"},"Guardian's Favor":{"name":"Guardian's Favor","pos":"b2","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the cooldown of your Blessing of Protection by 60 sec and increases the duration of your Blessing of Freedom by 5 sec.","Reduces the cooldown of your Blessing of Protection by 120 sec and increases the duration of your Blessing of Freedom by 10 sec."]],"arrows":[],"icon":"spell_holy_sealofprotection"},"Armor of the Righteous":{"name":"Armor of the Righteous","pos":"b4","maxRank":5,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces all damage taken by 2% while under the effects of Devotion Aura.","Reduces all damage taken by 4% while under the effects of Devotion Aura.","Reduces all damage taken by 6% while under the effects of Devotion Aura.","Reduces all damage taken by 8% while under the effects of Devotion Aura.","Reduces all damage taken by 10% while under the effects of Devotion Aura."]],"arrows":[],"icon":"spell_holy_devotionaura"},"Blessing of Sacrifice":{"name":"Blessing of Sacrifice","pos":"c1","maxRank":1,"reqPoints":10,"dependencyName":"","cost":"80 Mana","cooldown":"5 minutes cooldown","descriptions":[["Places a Blessing on the party member, transfering 50% damage taken per hit to the caster.  Lasts 10 seconds.  Players may only have one Blessing on them per Paladin at any one time. Once protected, the target cannot be made invulnerable by Divine Shield, Divine Protection, Blessing of Protection, or Blessing of Sacrifice again for 1 min."]],"arrows":[],"icon":"spell_holy_sealofsacrifice"},"Righteous Fury":{"name":"Righteous Fury","pos":"c2","maxRank":3,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the amount of threat generated by your Holy attacks while under the effects of Seal of Fury by 10%.","Increases the amount of threat generated by your Holy attacks while under the effects of Seal of Fury by 20%.","Increases the amount of threat generated by your Holy attacks while under the effects of Seal of Fury by 30%."]],"arrows":[],"icon":"spell_holy_sealoffury"},"Shield of Faith":{"name":"Shield of Faith","pos":"c3","maxRank":3,"reqPoints":10,"prereq":"Redoubt","dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the amount of damage absorbed by your shield by 10%.","Increases the amount of damage absorbed by your shield by 20%.","Increases the amount of damage absorbed by your shield by 30%."]],"arrows":[{"to":"c3","dir":"down","from":"a3"}],"icon":"inv_shield_06"},"Sentinel":{"name":"Sentinel","pos":"c4","maxRank":3,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the chance you are critically struck by melee and ranged attacks by 2%.","Reduces the chance you are critically struck by melee and ranged attacks by 4%.","Reduces the chance you are critically struck by melee and ranged attacks by 6%."]],"arrows":[],"icon":"spell_magic_lesserinvisibilty"},"Swift Justice":{"name":"Swift Justice","pos":"d2","maxRank":3,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Decreases the cooldown of your Hammer of Justice spell by 10 sec.","Decreases the cooldown of your Hammer of Justice spell by 20 sec.","Decreases the cooldown of your Hammer of Justice spell by 30 sec."]],"arrows":[],"icon":"spell_holy_sealofmight"},"Unyielding Faith":{"name":"Unyielding Faith","pos":"d3","maxRank":1,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"30 seconds cooldown","descriptions":[["The Paladin is filled with courage, becoming immune to fear and silence effects.  Lasts 10 seconds."]],"arrows":[],"icon":"spell_holy_unyieldingfaith"},"Holy Shield":{"name":"Holy Shield","pos":"e2","maxRank":1,"reqPoints":20,"dependencyName":"","cost":"10% Base Mana","cooldown":"8 seconds cooldown","descriptions":[["Increases chance to block by 50% for 10 seconds, and deals Holy damage equal to your block value while active.  Damage caused by Holy Shield causes 100% additional threat.  Each block expends a charge.  4 charges."]],"arrows":[],"icon":"spell_holy_blessingofprotection"},"Reckoning":{"name":"Reckoning","pos":"e3","maxRank":5,"reqPoints":20,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives you a 20% chance to gain an extra attack after blocking an attack.","Gives you a 40% chance to gain an extra attack after blocking an attack.","Gives you a 60% chance to gain an extra attack after blocking an attack.","Gives you a 80% chance to gain an extra attack after blocking an attack.","Gives you a 100% chance to gain an extra attack after blocking an attack."]],"arrows":[],"icon":"spell_holy_blessingofstrength"},"Sword of the Spirit":{"name":"Sword of the Spirit","pos":"f3","maxRank":5,"reqPoints":25,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases your damage dealt by one-handed weapons by 2%, and grants you 2% additional stamina.","Increases your damage dealt by one-handed weapons by 4%, and grants you 4% additional stamina.","Increases your damage dealt by one-handed weapons by 6%, and grants you 6% additional stamina.","Increases your damage dealt by one-handed weapons by 8%, and grants you 8% additional stamina.","Increases your damage dealt by one-handed weapons by 10%, and grants you 10% additional stamina."]],"arrows":[],"icon":"inv_sword_20"},"Ardent Defender":{"name":"Ardent Defender","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Holy Shield","dependencyName":"","cost":"","cooldown":"","descriptions":[["While below 35% health, damage taken is reduced by 35%."]],"arrows":[{"to":"g2","dir":"down","from":"e2"}],"icon":"spell_holy_greaterblessingofsanctuary"},"Eye for an Eye":{"name":"Eye for an Eye","pos":"e1","maxRank":5,"reqPoints":20,"dependencyName":"","cost":"","cooldown":"","descriptions":[["All spell damage against you causes 5% of the damage taken to the caster as well.  The damage caused by Eye for an Eye will not exceed 50% of the Paladin's total health.","All spell damage against you causes 10% of the damage taken to the caster as well.  The damage caused by Eye for an Eye will not exceed 50% of the Paladin's total health.","All spell damage against you causes 15% of the damage taken to the caster as well.  The damage caused by Eye for an Eye will not exceed 50% of the Paladin's total health.","All spell damage against you causes 20% of the damage taken to the caster as well.  The damage caused by Eye for an Eye will not exceed 50% of the Paladin's total health.","All spell damage against you causes 25% of the damage taken to the caster as well.  The damage caused by Eye for an Eye will not exceed 50% of the Paladin's total health."]],"arrows":[],"icon":"spell_holy_eyeforaneye"}}}}