{"Protection":{"name":"Protection","background":"protection","icon":"","talents":{"Toughness":{"name":"Toughness","pos":"a2","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases your resistance and armor value from items by 2%.","Increases your resistance and armor value from items by 4%.","Increases your resistance and armor value from items by 6%.","Increases your resistance and armor value from items by 8%.","Increases your resistance and armor value from items by 10%."],"icon":"spell_holy_devotion"},"Shield Specialization":{"name":"Shield Specialization","pos":"a3","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the amount of damage absorbed by your shield by 15%.","Increases the amount of damage absorbed by your shield by 30%."],"icon":"inv_shield_06"},"Precision":{"name":"Precision","pos":"b4","maxRank":5,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases your chance to hit with melee attacks and spells by 1%.","Increases your chance to hit with melee attacks and spells by 2%.","Increases your chance to hit with melee attacks and spells by 3%.","Increases your chance to hit with melee attacks and spells by 4%.","Increases your chance to hit with melee attacks and spells by 5%."],"icon":"ability_rogue_ambush"},"Guardian's Favor":{"name":"Guardian's Favor","pos":"d1","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the effect of your Blessing of Salvation and Blessing of Sanctuary by 10%. \n\nAlso increases the duration and reduces the mana cost of your Blessings of Freedom, Protection, Sacrifice, Salvation and Sanctuary by 50%.","Increases the effect of your Blessing of Salvation and Blessing of Sanctuary by 20%. \n\nAlso increases the duration and reduces the mana cost of your Blessings of Freedom, Protection, Sacrifice, Salvation and Sanctuary by 100%."],"icon":"spell_holy_sealofprotection"},"Redoubt":{"name":"Redoubt","pos":"b3","maxRank":5,"reqPoints":5,"prereq":"Shield Specialization","cost":"","cooldown":"","descriptions":["Gives you an 4% chance when hit to gain an 30% chance to block attacks for 15 seconds seconds or undefined blocks. Critical hits grant this effect five times more often.","Gives you an 8% chance when hit to gain an 30% chance to block attacks for 15 seconds seconds or undefined blocks. Critical hits grant this effect five times more often.","Gives you an 12% chance when hit to gain an 30% chance to block attacks for 15 seconds seconds or undefined blocks. Critical hits grant this effect five times more often.","Gives you an 16% chance when hit to gain an 30% chance to block attacks for 15 seconds seconds or undefined blocks. Critical hits grant this effect five times more often.","Gives you an 20% chance when hit to gain an 30% chance to block attacks for 15 seconds seconds or undefined blocks. Critical hits grant this effect five times more often."],"icon":"ability_defend"},"Improved Hammer of Justice":{"name":"Improved Hammer of Justice","pos":"a1","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the duration of your Hammer of Justice spell by 0.5 sec and reduces its cooldown by 10%.","Increases the duration of your Hammer of Justice spell by 1 sec and reduces its cooldown by 20%.","Increases the duration of your Hammer of Justice spell by 1.5 sec and reduces its cooldown by 30%."],"icon":"spell_holy_sealofmight"},"Dominance":{"name":"Dominance","pos":"c1","maxRank":1,"reqPoints":10,"prereq":"Vindication","cost":"","cooldown":"","descriptions":["Degenerates the movement and attack capabilities of nearby opponents by 15%."],"icon":"spell_nature_reincarnation"},"Blessing of Sanctuary":{"name":"Blessing of Sanctuary","pos":"c2","maxRank":1,"reqPoints":10,"cost":"90 Mana","cooldown":"","descriptions":["Places a Blessing on the friendly target, reducing damage taken by up to 10 for 10 minutes.  In addition, attackers will take 10 Holy damage.  Players may only have one Blessing on them per Paladin at any one time."],"icon":"spell_nature_lightningshield"},"One-Handed Weapon Specialization":{"name":"One-Handed Weapon Specialization","pos":"d3","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the damage you deal with one-handed melee weapons by 2%.","Increases the damage you deal with one-handed melee weapons by 4%.","Increases the damage you deal with one-handed melee weapons by 6%.","Increases the damage you deal with one-handed melee weapons by 8%.","Increases the damage you deal with one-handed melee weapons by 10%."],"icon":"inv_sword_20"},"Vindication":{"name":"Vindication","pos":"b1","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Gives the Paladin's damaging melee attacks a chance to reduce the target's stats by 10% for 10 seconds.","Gives the Paladin's damaging melee attacks a chance to reduce the target's stats by 10% for 20 seconds.","Gives the Paladin's damaging melee attacks a chance to reduce the target's stats by 10% for 30 seconds."],"icon":"spell_holy_vindication"},"Improved Defensive Auras":{"name":"Improved Defensive Auras","pos":"b2","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the armor and resistance bonus of your Devotion and Resistance auras by 25%.","Increases the armor and resistance bonus of your Devotion and Resistance auras by 50%."],"icon":"spell_holy_devotionaura"},"Improved Concentration Aura":{"name":"Improved Concentration Aura","pos":"c3","maxRank":3,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the effect of your Concentration Aura by an additional 5% and gives all group members affected by the aura an additional 5% chance to resist Silence and Interrupt effects.","Increases the effect of your Concentration Aura by an additional 10% and gives all group members affected by the aura an additional 10% chance to resist Silence and Interrupt effects.","Increases the effect of your Concentration Aura by an additional 15% and gives all group members affected by the aura an additional 15% chance to resist Silence and Interrupt effects."],"icon":"spell_holy_mindsooth"},"Second Wind":{"name":"Second Wind","pos":"c4","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Restores mana equal to 4% of healing received.","Restores mana equal to 8% of healing received.","Restores mana equal to 12% of healing received.","Restores mana equal to 16% of healing received.","Restores mana equal to 20% of healing received."],"icon":"inv_jewelry_talisman_06"},"Improved Righteous Fury":{"name":"Improved Righteous Fury","pos":"e4","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Increases the amount of threat generated while under the effect of Righteous Fury by 10%.","Increases the amount of threat generated while under the effect of Righteous Fury by 20%.","Increases the amount of threat generated while under the effect of Righteous Fury by 30%."],"icon":"spell_holy_sealoffury"},"Holy Shield":{"name":"Holy Shield","pos":"e2","maxRank":1,"reqPoints":20,"prereq":"Blessing of Sanctuary","cost":"120 Mana","cooldown":"10 seconds cooldown","descriptions":["Increases chance to block by 30% for 10 seconds, and deals 45 Holy damage for each attack blocked while active.  Damage caused by Holy Shield causes twice extra threat.  Each block expends a charge.  undefined charges."],"icon":"spell_holy_blessingofprotection"},"Unbreakability":{"name":"Unbreakability","pos":"d4","maxRank":3,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Decreases damage taken by 5%.","Decreases damage taken by 10%.","Decreases damage taken by 15%."],"icon":"inv_shield_20"},"Morale":{"name":"Morale","pos":"f2","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Protects you agaist the next Fear effect once every 1 minute. In addition, your melee attacks have a 4% chance to restore 125 Mana.","Protects you agaist the next Fear effect once every 1 minute. In addition, your melee attacks have a 8% chance to restore 125 Mana.","Protects you agaist the next Fear effect once every 1 minute. In addition, your melee attacks have a 12% chance to restore 125 Mana.","Protects you agaist the next Fear effect once every 50 seconds. In addition, your melee attacks have a 16% chance to restore 125 Mana.","Protects you agaist the next Fear effect once every 40 seconds. In addition, your melee attacks have a 20% chance to restore 125 Mana."],"icon":"spell_holy_heroism"},"Improved Holy Shield":{"name":"Improved Holy Shield","pos":"e1","maxRank":2,"reqPoints":20,"prereq":"Holy Shield","cost":"","cooldown":"","descriptions":["Allows your Holy Shield to block an additional 3 attacks and increases it's duration by 5 second.","Allows your Holy Shield to block an additional 6 attacks and increases it's duration by 10 second."],"icon":"spell_holy_blessingofprotection"},"Reckoning":{"name":"Reckoning","pos":"f3","maxRank":5,"reqPoints":25,"prereq":"One-Handed Weapon Specialization","cost":"","cooldown":"","descriptions":["Gives you a 4% chance to gain an extra attack after being hit by attack or spell. The critical attack have 5 times higher chance to grant extra attack.","Gives you a 8% chance to gain an extra attack after being hit by attack or spell. The critical attack have 5 times higher chance to grant extra attack.","Gives you a 12% chance to gain an extra attack after being hit by attack or spell. The critical attack have 5 times higher chance to grant extra attack.","Gives you a 16% chance to gain an extra attack after being hit by attack or spell. The critical attack have 5 times higher chance to grant extra attack.","Gives you a 20% chance to gain an extra attack after being hit by attack or spell. The critical attack have 5 times higher chance to grant extra attack."],"icon":"spell_holy_blessingofstrength"},"Seal of Fury":{"name":"Seal of Fury","pos":"g2","maxRank":1,"reqPoints":30,"cost":"8% Base Mana","cooldown":"","descriptions":["Fills the Paladin with divine fury for 2 minutes, causing melee attacks to deal additional physical damage equal to 30% of normal weapon damage to all targets in front of the Paladin. Only one Seal can be active on the Paladin at any one time.\n\nUnleashing this Seal's energy will judge an enemy for 3 seconds, silencing the target and forcing it to attack you. Has no effect if the target is already attacking you."],"icon":"spell_holy_crusader"}}}}