{"Affliction":{"name":"Affliction","background":"affliction","icon":"","talents":{"Improved Life Tap":{"name":"Improved Life Tap","pos":"a2","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the amount of Mana awarded by your Life Tap spell by 10%.","Increases the amount of Mana awarded by your Life Tap spell by 20%."],"icon":"spell_shadow_burningspirit"},"Jinx":{"name":"Jinx","pos":"a3","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the effect of your Curse of Exhaustion and Curse of Weakness by 10% and the duration of your Curse of Weakness, Curse of Recklessness, Curse of Shadow and Curse of the Elements by 30 sec.","Increases the effect of your Curse of Exhaustion and Curse of Weakness by 20% and the duration of your Curse of Weakness, Curse of Recklessness, Curse of Shadow and Curse of the Elements by 60 sec.","Increases the effect of your Curse of Exhaustion and Curse of Weakness by 30% and the duration of your Curse of Weakness, Curse of Recklessness, Curse of Shadow and Curse of the Elements by 90 sec."],"icon":"spell_shadow_curseofmannoroth"},"Improved Corruption":{"name":"Improved Corruption","pos":"b4","maxRank":5,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the mana cost and threat caused by your Corruption spell by 6%.","Reduces the mana cost and threat caused by your Corruption spell by 12%.","Reduces the mana cost and threat caused by your Corruption spell by 18%.","Reduces the mana cost and threat caused by your Corruption spell by 24%.","Reduces the mana cost and threat caused by your Corruption spell by 30%."],"icon":"spell_shadow_abominationexplosion"},"Bubonic Trail":{"name":"Bubonic Trail","pos":"e3","maxRank":2,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Afflicts nearby enemies with a disease that causes Nature damage equal to 50% of your level every undefined1 sec. and slows their movement and attack speed by 5%. Lasts 12 seconds.","Afflicts nearby enemies with a disease that causes Nature damage equal to your level every undefined1 sec. and slows their movement and attack speed by 10%. Lasts 12 seconds."],"icon":"spell_shadow_callofbone"},"Suppression":{"name":"Suppression","pos":"b2","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the range of your Affliction spells by 5 yds and reduces the chance for enemies to resist your Affliction spells by 2%.","Increases the range of your Affliction spells by 10 yds and reduces the chance for enemies to resist your Affliction spells by 4%."],"icon":"spell_shadow_unsummonbuilding"},"Improved Curse of Agony":{"name":"Improved Curse of Agony","pos":"b3","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the damage done by your Curse of Agony by 2%.","Increases the damage done by your Curse of Agony by 3%.","Increases the damage done by your Curse of Agony by 6%."],"icon":"spell_shadow_curseofsargeras"},"Improved Drain":{"name":"Improved Drain","pos":"c1","maxRank":2,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the Health drained by your Drain Life spell by 5% and causes 15% of the Mana drained by your Drain Mana spell to damage the opponent.","Increases the Health drained by your Drain Life spell by 10% and causes 30% of the Mana drained by your Drain Mana spell to damage the opponent."],"icon":"drainingall"},"Fel Concentration":{"name":"Fel Concentration","pos":"a1","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Gives you a 14% chance to avoid interruption caused by damage while channeling the Drain Life, Drain Mana, or Drain Soul spell.","Gives you a 28% chance to avoid interruption caused by damage while channeling the Drain Life, Drain Mana, or Drain Soul spell.","Gives you a 42% chance to avoid interruption caused by damage while channeling the Drain Life, Drain Mana, or Drain Soul spell.","Gives you a 56% chance to avoid interruption caused by damage while channeling the Drain Life, Drain Mana, or Drain Soul spell.","Gives you a 70% chance to avoid interruption caused by damage while channeling the Drain Life, Drain Mana, or Drain Soul spell."],"icon":"spell_shadow_fingerofdeath"},"Amplify Curse":{"name":"Amplify Curse","pos":"c3","maxRank":1,"reqPoints":10,"prereq":"Improved Curse of Agony","cost":"","cooldown":"5 minutes cooldown","descriptions":["Increases the effect of your next Curse by 50%.  Lasts 10 seconds."],"icon":"spell_shadow_contagion"},"Improved Drain Soul":{"name":"Improved Drain Soul","pos":"d1","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Reduces the cooldown of Drain Soul spell by 5 sec.\nAlso gives you a 50% chance to get a 100% increase to your Mana regeneration, that may continue to regenerate while casting at 50% of normal, for 10 seconds if the target is killed by you while you drain its soul.","Reduces the cooldown of Drain Soul spell by 10 sec.\nAlso gives you a 100% chance to get a 100% increase to your Mana regeneration, that may continue to regenerate while casting at 50% of normal, for 10 seconds if the target is killed by you while you drain its soul."],"icon":"spell_shadow_haunting"},"Nightfall":{"name":"Nightfall","pos":"d2","maxRank":3,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Your periodic Shadow damage have a 1% chance to cause you to enter a Shadow Trance state.\n\nThe Shadow Trance state reduces the casting time of your next Shadow Bolt spell by 100%.\nCan occur only once per 10 sec.","Your periodic Shadow damage have a 2% chance to cause you to enter a Shadow Trance state.\n\nThe Shadow Trance state reduces the casting time of your next Shadow Bolt spell by 100%.\nCan occur only once per 10 sec.","Your periodic Shadow damage have a 3% chance to cause you to enter a Shadow Trance state.\n\nThe Shadow Trance state reduces the casting time of your next Shadow Bolt spell by 100%.\nCan occur only once per 10 sec."],"icon":"spell_shadow_twilight"},"Herald of Woe":{"name":"Herald of Woe","pos":"d3","maxRank":2,"reqPoints":15,"prereq":"Amplify Curse","cost":"","cooldown":"","descriptions":["Decreases the cooldown of your Amplify Curse, Death and Decay and Death Coil spells by 10%.","Decreases the cooldown of your Amplify Curse, Death and Decay and Death Coil spells by 20%."],"icon":"cloak_of_flame"},"Siphon Life":{"name":"Siphon Life","pos":"e1","maxRank":1,"reqPoints":20,"cost":"90 mana","cooldown":"","descriptions":["Transfers 15 health from the target to the caster every undefined1 sec.  Stacks up to undefined times and lasts for 30 seconds."],"icon":"spell_shadow_requiem"},"Black Speech":{"name":"Black Speech","pos":"c2","maxRank":3,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases your chance to resist Silence and Interrupt effects by an additional 10%.","Increases your chance to resist Silence and Interrupt effects by an additional 20%.","Increases your chance to resist Silence and Interrupt effects by an additional 30%."],"icon":"spell_shadow_soulleech"},"Death and Decay":{"name":"Death and Decay","pos":"e4","maxRank":1,"reqPoints":20,"prereq":"Improved Corruption","cost":"50% base mana","cooldown":"5 minutes cooldown","descriptions":["Invokes the malignant power of death and decay, reducing the effectiveness of any healing by 20% and inflicting Shadow damage equal to your level to nearby enemies every undefined2 seconds for 30 seconds."],"icon":"spell_shadow_deathanddecay"},"Shadow Mastery":{"name":"Shadow Mastery","pos":"f1","maxRank":5,"reqPoints":25,"prereq":"Siphon Life","cost":"","cooldown":"","descriptions":["Increases the damage dealt or life drained by your Shadow spells by 2%.","Increases the damage dealt or life drained by your Shadow spells by 4%.","Increases the damage dealt or life drained by your Shadow spells by 6%.","Increases the damage dealt or life drained by your Shadow spells by 8%.","Increases the damage dealt or life drained by your Shadow spells by 10%."],"icon":"spell_shadow_shadetruesight"},"Inevitable Doom":{"name":"Inevitable Doom","pos":"f2","maxRank":5,"reqPoints":25,"prereq":"Nightfall","cost":"","cooldown":"","descriptions":["Gives your Affliction spells an additional 5% chance to resist dispel effects.\nAlso, it reduces the cooldown and duration of your Curse of Doom by 10%, increases its damage and reduces threat caused by 20%.","Gives your Affliction spells an additional 10% chance to resist dispel effects.\nAlso, it reduces the cooldown and duration of your Curse of Doom by 20%, increases its damage and reduces threat caused by 40%.","Gives your Affliction spells an additional 15% chance to resist dispel effects.\nAlso, it reduces the cooldown and duration of your Curse of Doom by 30%, increases its damage and reduces threat caused by 60%.","Gives your Affliction spells an additional 20% chance to resist dispel effects.\nAlso, it reduces the cooldown and duration of your Curse of Doom by 40%, increases its damage and reduces threat caused by 80%.","Gives your Affliction spells an additional 25% chance to resist dispel effects.\nAlso, it reduces the cooldown and duration of your Curse of Doom by 50%, increases its damage and reduces threat caused by 100%."],"icon":"spell_shadow_auraofdarkness"},"Prolonged Misery":{"name":"Prolonged Misery","pos":"f3","maxRank":3,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Increases the duration of your Corruption, Curse of Agony and Immolate spells by 2 sec.","Increases the duration of your Corruption, Curse of Agony and Immolate spells by 4 sec.","Increases the duration of your Corruption, Curse of Agony, Curse of Exhaustion and Immolate spells by 6 sec."],"icon":"spell_shadow_unstableafllictions"},"Defiler":{"name":"Defiler","pos":"g2","maxRank":1,"reqPoints":30,"cost":"","cooldown":"","descriptions":["Reduces the time between periodic ticks and duration of your Affliction spells by 20%."],"icon":"inevitabledoom"}}}}