{"Affliction":{"name":"Affliction","background":"affliction","icon":"","talents":{"Suppression":{"name":"Suppression","pos":"a2","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the chance for enemies to resist your Affliction spells by 2%.","Reduces the chance for enemies to resist your Affliction spells by 4%.","Reduces the chance for enemies to resist your Affliction spells by 6%.","Reduces the chance for enemies to resist your Affliction spells by 8%.","Reduces the chance for enemies to resist your Affliction spells by 10%."]],"arrows":[],"icon":"spell_shadow_unsummonbuilding"},"Contagion":{"name":"Contagion","pos":"a3","maxRank":5,"reqPoints":0,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the damage of your Corruption spell by 2%.","Increases the damage of your Corruption spell by 4%.","Increases the damage of your Corruption spell by 6%.","Increases the damage of your Corruption spell by 8%.","Increases the damage of your Corruption spell by 10%."]],"arrows":[],"icon":"spell_shadow_abominationexplosion"},"Weakened Grip":{"name":"Weakened Grip","pos":"b1","maxRank":3,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the effect of your Curse of Weakness by 10%, and gives your Curse of Weakness a 5% chance to disarm your opponent when they make a melee attack.","Increases the effect of your Curse of Weakness by 20%, and gives your Curse of Weakness a 10% chance to disarm your opponent when they make a melee attack.","Increases the effect of your Curse of Weakness by 30%, and gives your Curse of Weakness a 15% chance to disarm your opponent when they make a melee attack."]],"arrows":[],"icon":"spell_shadow_curseofmannoroth"},"Restless Soul":{"name":"Restless Soul","pos":"b2","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the rate of damage of your Drain Soul spell by 1 sec, and gives you a 50% chance to get a 100% increase to your Mana regeneration for 10 seconds if the target is killed by you while you drain its soul.  In addition your Mana may continue to regenerate while casting at 50% of normal.","Increases the rate of damage of your Drain Soul spell by 2 sec, and gives you a 100% chance to get a 100% increase to your Mana regeneration for 10 seconds if the target is killed by you while you drain its soul.  In addition your Mana may continue to regenerate while casting at 50% of normal."]],"arrows":[],"icon":"spell_shadow_haunting"},"Soul Trader":{"name":"Soul Trader","pos":"b3","maxRank":2,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the amount of Mana awarded by your Life Tap spell by 25%.","Increases the amount of Mana awarded by your Life Tap spell by 50%."]],"arrows":[],"icon":"spell_shadow_burningspirit"},"Misery":{"name":"Misery","pos":"b4","maxRank":5,"reqPoints":5,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the Health drained by your Drain Life spell by 5%, and increases the duration by 20%.","Increases the Health drained by your Drain Life spell by 10%, and increases the duration by 40%.","Increases the Health drained by your Drain Life spell by 15%, and increases the duration by 60%.","Increases the Health drained by your Drain Life spell by 20%, and increases the duration by 80%.","Increases the Health drained by your Drain Life spell by 25%, and increases the duration by 100%."]],"arrows":[],"icon":"spell_shadow_lifedrain02"},"Agonizing Pain":{"name":"Agonizing Pain","pos":"c1","maxRank":5,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the duration of your Curse of Agony by 5%, and reduces the cost by 2%.","Increases the duration of your Curse of Agony by 10%, and reduces the cost by 4%.","Increases the duration of your Curse of Agony by 15%, and reduces the cost by 6%.","Increases the duration of your Curse of Agony by 20%, and reduces the cost by 8%.","Increases the duration of your Curse of Agony by 25%, and reduces the cost by 10%."]],"arrows":[],"icon":"spell_shadow_curseofsargeras"},"Fel Concentration":{"name":"Fel Concentration","pos":"c2","maxRank":5,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives you a 14% chance to avoid interruption caused by damage while casting Fear and Howl of Terror, and while channeling Shadow spells.","Gives you a 28% chance to avoid interruption caused by damage while casting Fear and Howl of Terror, and while channeling Shadow spells.","Gives you a 42% chance to avoid interruption caused by damage while casting Fear and Howl of Terror, and while channeling Shadow spells.","Gives you a 56% chance to avoid interruption caused by damage while casting Fear and Howl of Terror, and while channeling Shadow spells.","Gives you a 70% chance to avoid interruption caused by damage while casting Fear and Howl of Terror, and while channeling Shadow spells."]],"arrows":[],"icon":"spell_shadow_fingerofdeath"},"Amplify Curse":{"name":"Amplify Curse","pos":"c3","maxRank":1,"reqPoints":10,"dependencyName":"","cost":"","cooldown":"3 minutes cooldown","descriptions":[["Increases the effect of your next Curse of Weakness, Curse of Agony, Curse of the Elements or Curse of Shadows by 50%. Lasts 30 seconds."]],"arrows":[],"icon":"spell_shadow_contagion"},"Grim Reach":{"name":"Grim Reach","pos":"d1","maxRank":2,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the range of your Affliction spells by 10%.","Increases the range of your Affliction spells by 20%."]],"arrows":[],"icon":"spell_shadow_callofbone"},"Nightfall":{"name":"Nightfall","pos":"d2","maxRank":2,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Gives your damage-over-time and drain spells a 2% chance to cause you to enter a Shadow Trance state after damaging the opponent.  The Shadow Trance state reduces the casting time of your next Shadow Bolt spell by 100%.","Gives your damage-over-time and drain spells a 4% chance to cause you to enter a Shadow Trance state after damaging the opponent.  The Shadow Trance state reduces the casting time of your next Shadow Bolt spell by 100%."]],"arrows":[],"icon":"spell_shadow_twilight"},"Despair":{"name":"Despair","pos":"d4","maxRank":2,"reqPoints":15,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the cost of Drain Mana by 50%, and causes 50% of the Mana drained by your Drain Mana spell to damage the opponent.","Reduces the cost of Drain Mana by 100%, and causes 50% of the Mana drained by your Drain Mana spell to damage the opponent."]],"arrows":[],"icon":"spell_shadow_siphonmana"},"Siphon Life":{"name":"Siphon Life","pos":"e2","maxRank":1,"reqPoints":20,"dependencyName":"","cost":"150 Mana","cooldown":"","descriptions":[["Transfers 15 health from the target to the caster every 3 sec.  Lasts 30 seconds."]],"arrows":[],"icon":"spell_shadow_requiem"},"Curse of Exhaustion":{"name":"Curse of Exhaustion","pos":"e3","maxRank":1,"reqPoints":20,"prereq":"Amplify Curse","dependencyName":"","cost":"8% Base Mana","cooldown":"","descriptions":[["Reduces the target's movement speed by 40% for 12 seconds.  Only one Curse per Warlock can be active on any one target."]],"arrows":[{"to":"e3","dir":"down","from":"c3"}],"icon":"spell_shadow_grimward"},"Mortal Coil":{"name":"Mortal Coil","pos":"e4","maxRank":4,"reqPoints":20,"prereq":"Curse of Exhaustion","dependencyName":"","cost":"","cooldown":"","descriptions":[["Reduces the global cooldown of your Curses by 0.1 seconds, increases the amount of targets affected by Howl of Terror by 5, and reduces the cooldown of your Death Coil by 15 seconds.","Reduces the global cooldown of your Curses by 0.2 seconds, increases the amount of targets affected by Howl of Terror by 10, and reduces the cooldown of your Death Coil by 30 seconds.","Reduces the global cooldown of your Curses by 0.3 seconds, increases the amount of targets affected by Howl of Terror by 15, and reduces the cooldown of your Death Coil by 45 seconds.","Reduces the global cooldown of your Curses by 0.4 seconds, increases the amount of targets affected by Howl of Terror by 20, and reduces the cooldown of your Death Coil by 60 seconds."]],"arrows":[{"to":"e4","dir":"right","from":"e3"}],"icon":"spell_shadow_deathcoil"},"Shadow Mastery":{"name":"Shadow Mastery","pos":"f2","maxRank":5,"reqPoints":25,"prereq":"Siphon Life","dependencyName":"","cost":"","cooldown":"","descriptions":[["Increases the damage dealt or life drained by your Shadow spells by 2%.","Increases the damage dealt or life drained by your Shadow spells by 4%.","Increases the damage dealt or life drained by your Shadow spells by 6%.","Increases the damage dealt or life drained by your Shadow spells by 8%.","Increases the damage dealt or life drained by your Shadow spells by 10%."]],"arrows":[{"to":"f2","dir":"down","from":"e2"}],"icon":"spell_shadow_shadetruesight"},"Dark Pact":{"name":"Dark Pact","pos":"g2","maxRank":1,"reqPoints":30,"dependencyName":"","cost":"","cooldown":"","descriptions":[["Each time your Corruption spell deals damage, it will spread to a nearby hostile target."]],"arrows":[],"icon":"spell_shadow_darkritual"}}}}