{"Demonology":{"name":"Demonology","background":"demonology","icon":"","talents":{"Improved Imp":{"name":"Improved Imp","pos":"a1","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the effect of your Imp's Firebolt, Fire Shield, and Blood Pact spells by 10%.","Increases the effect of your Imp's Firebolt, Fire Shield, and Blood Pact spells by 20%.","Increases the effect of your Imp's Firebolt, Fire Shield, and Blood Pact spells by 30%."],"icon":"spell_shadow_summonimp"},"Improved Healthstone":{"name":"Improved Healthstone","pos":"a2","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the amount of Health restored by your Healthstone by 10%.","Increases the amount of Health restored by your Healthstone by 20%."],"icon":"inv_stone_04"},"Demonic Embrace":{"name":"Demonic Embrace","pos":"a3","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases your total Stamina by 2% but reduces your total Spirit by 1%.  In addition, gives your Shadow Ward a 6% chance to reflect Shadow spells and effects while active.","Increases your total Stamina by 4% but reduces your total Spirit by 2%.  In addition, gives your Shadow Ward a 12% chance to reflect Shadow spells and effects while active.","Increases your total Stamina by 6% but reduces your total Spirit by 3%.  In addition, gives your Shadow Ward a 18% chance to reflect Shadow spells and effects while active.","Increases your total Stamina by 8% but reduces your total Spirit by 4%.  In addition, gives your Shadow Ward a 24% chance to reflect Shadow spells and effects while active.","Increases your total Stamina by 10% but reduces your total Spirit by 5%.  In addition, gives your Shadow Ward a 30% chance to reflect Shadow spells and effects while active."],"icon":"spell_shadow_metamorphosis"},"Improved Voidwalker":{"name":"Improved Voidwalker","pos":"b1","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the effectiveness of your Voidwalker's Torment, Consume Shadows, Sacrifice and Suffering spells by 10%.","Increases the effectiveness of your Voidwalker's Torment, Consume Shadows, Sacrifice and Suffering spells by 20%.","Increases the effectiveness of your Voidwalker's Torment, Consume Shadows, Sacrifice and Suffering spells by 30%."],"icon":"spell_shadow_summonvoidwalker"},"Damned Vanguard":{"name":"Damned Vanguard","pos":"c4","maxRank":2,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Decreases damage taken by your demons by 11% and increases threat generated by them by 9%.","Decreases damage taken by your demons by 21% and increases threat generated by them by 19%."],"icon":"demonic_resilence"},"Unholy Power":{"name":"Unholy Power","pos":"b3","maxRank":5,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the damage done by your Imp, Voidwalker, Succubus, and Felhunter by 3%.","Increases the damage done by your Imp, Voidwalker, Succubus, and Felhunter by 6%.","Increases the damage done by your Imp, Voidwalker, Succubus, and Felhunter by 9%.","Increases the damage done by your Imp, Voidwalker, Succubus, and Felhunter by 12%.","Increases the damage done by your Imp, Voidwalker, Succubus, and Felhunter by 15%."],"icon":"spell_shadow_shadowworddominate"},"Improved Health Funnel":{"name":"Improved Health Funnel","pos":"b4","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Increases the effectiveness of your Health Funnel spell by 25%.","Increases the effectiveness of your Health Funnel spell by 50%."],"icon":"spell_shadow_lifedrain"},"Improved Succubus":{"name":"Improved Succubus","pos":"c1","maxRank":3,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the effect of your Succubus' Lash of Pain and Soothing Kiss spells by 10%, and increases the duration of your Succubus' Seduction and Lesser Invisibility spells by 10%.","Increases the effect of your Succubus' Lash of Pain and Soothing Kiss spells by 20%, and increases the duration of your Succubus' Seduction and Lesser Invisibility spells by 20%.","Increases the effect of your Succubus' Lash of Pain and Soothing Kiss spells by 30%, and increases the duration of your Succubus' Seduction and Lesser Invisibility spells by 30%."],"icon":"spell_shadow_summonsuccubus"},"Fel Domination":{"name":"Fel Domination","pos":"c2","maxRank":1,"reqPoints":10,"cost":"","cooldown":"5 minutes cooldown","descriptions":["Your next Imp, Voidwalker, Succubus, or Felhunter Summon spell has its casting time reduced by 4 sec and its Mana cost reduced by 40%. In addition, reduces the casting time of your next Enslave Demon spell by up to 3 sec."],"icon":"spell_nature_removecurse"},"Demonic Onslaught":{"name":"Demonic Onslaught","pos":"c3","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases the melee and spell critical strike chance of your Imp, Voidwalker, Succubus, and Felhunter by 3%.","Increases the melee and spell critical strike chance of your Imp, Voidwalker, Succubus, and Felhunter by 7%.","Increases the melee and spell critical strike chance of your Imp, Voidwalker, Succubus, and Felhunter by 11%.","Increases the melee and spell critical strike chance of your Imp, Voidwalker, Succubus, and Felhunter by 15%.","Increases the melee and spell critical strike chance of your Imp, Voidwalker, Succubus, and Felhunter by 19%."],"icon":"inv_misc_horn_02"},"Master Conjuror":{"name":"Master Conjuror","pos":"b2","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the Mana cost and casting time of your Stone creation spells by 25% and increases the effectiveness of your Spellstones and Firestones by 20%.","Reduces the Mana cost and casting time of your Stone creation spells by 50% and increases the effectiveness of your Spellstones and Firestones by 40%."],"icon":"spell_shadow_soulgem"},"Fel Intellect":{"name":"Fel Intellect","pos":"d1","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the maximum Mana of your demons by 5% and your total Intellect by 3%.","Increases the maximum Mana of your demons by 10% and your total Intellect by 6%.","Increases the maximum Mana of your demons by 15% and your total Intellect by 9%.","Increases the maximum Mana of your demons by 20% and your total Intellect by 12%.","Increases the maximum Mana of your demons by 25% and your total Intellect by 15%."],"icon":"spell_holy_magicalsentry"},"Master Summoner":{"name":"Master Summoner","pos":"d2","maxRank":2,"reqPoints":15,"prereq":"Fel Domination","cost":"","cooldown":"","descriptions":["Reduces the casting time of your Imp, Voidwalker, Succubus, and Felhunter Summoning spells by 3 sec and the Mana cost by 30%.","Reduces the casting time of your Imp, Voidwalker, Succubus, and Felhunter Summoning spells by 6 sec and the Mana cost by 60%."],"icon":"spell_shadow_impphaseshift"},"Fel Stamina":{"name":"Fel Stamina","pos":"d4","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the maximum Health of your demons by 5% and your total Stamina by 3%.","Increases the maximum Health of your demons by 10% and your total Stamina by 6%.","Increases the maximum Health of your demons by 15% and your total Stamina by 9%.","Increases the maximum Health of your demons by 20% and your total Stamina by 12%.","Increases the maximum Health of your demons by 25% and your total Stamina by 15%."],"icon":"spell_shadow_antishadow"},"Improved Felhunter":{"name":"Improved Felhunter","pos":"e1","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Increases the effectiveness of your Felhunter's Mana Burn and Paranoia spells by 10% and reduces the cooldown of your Felhunter's Devour Magic and Spell Lock spells by 10%.","Increases the effectiveness of your Felhunter's Mana Burn and Paranoia spells by 20% and reduces the cooldown of your Felhunter's Devour Magic and Spell Lock spells by 20%.","Increases the effectiveness of your Felhunter's Mana Burn and Paranoia spells by 30% and reduces the cooldown of your Felhunter's Devour Magic and Spell Lock spells by 30%."],"icon":"spell_shadow_summonfelhunter"},"Soul Link":{"name":"Soul Link","pos":"e2","maxRank":1,"reqPoints":20,"cost":"40% Base Mana","cooldown":"20 seconds cooldown","descriptions":["When active, 20% of all damage taken by the caster is taken by your summoned demon instead.  In addition, the demon shares the master's stats, and both the demon and master will inflict 5% more damage.  Lasts as long as the demon is active."],"icon":"spell_shadow_gathershadows"},"Improved Enslave Demon":{"name":"Improved Enslave Demon","pos":"e4","maxRank":2,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Reduces the Attack Speed penalty of your Enslave Demon spell by 20% and reduces the chance it will be resisted by 5%.","Reduces the Attack Speed penalty of your Enslave Demon spell by 40% and reduces the chance it will be resisted by 10%."],"icon":"spell_shadow_enslavedemon"},"Master Demonologist":{"name":"Master Demonologist","pos":"f1","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Grants both the Warlock and the summoned demon an effect as long as that demon is active.\n\nImp - Increases your critical strike chance by 2%.\n\nVoidwalker - Reduces physical damage taken by 4%.\n\nSuccubus - Increases all damage caused by 2%.\n\nFelhunter - Increases all resistances by .2 per level.","Grants both the Warlock and the summoned demon an effect as long as that demon is active.\n\nImp - Increases your critical strike chance by 5%.\n\nVoidwalker - Reduces physical damage taken by 7%.\n\nSuccubus - Increases all damage caused by 5%.\n\nFelhunter - Increases all resistances by .4 per level.","Grants both the Warlock and the summoned demon an effect as long as that demon is active.\n\nImp - Increases your critical strike chance by 8%.\n\nVoidwalker - Reduces physical damage taken by 10%.\n\nSuccubus - Increases all damage caused by 8%.\n\nFelhunter - Increases all resistances by .6 per level.","Grants both the Warlock and the summoned demon an effect as long as that demon is active.\n\nImp - Increases your critical strike chance by 11%.\n\nVoidwalker - Reduces physical damage taken by 13%.\n\nSuccubus - Increases all damage caused by 11%.\n\nFelhunter - Increases all resistances by .8 per level.","Grants both the Warlock and the summoned demon an effect as long as that demon is active.\n\nImp - Increases your critical strike chance by 14%.\n\nVoidwalker - Reduces physical damage taken by 16%.\n\nSuccubus - Increases all damage caused by 14%.\n\nFelhunter - Increases all resistances by 1 per level."],"icon":"spell_shadow_shadowpact"},"Fel Pact":{"name":"Fel Pact","pos":"f3","maxRank":5,"reqPoints":25,"prereq":"Demonic Onslaught","cost":"","cooldown":"","descriptions":["Demon's critical hits from a spells or abilities have a 8% chance to generate 1% of your total total Mana over 15 seconds. In addition, your spell casts have a 2% chance to regenerate 1% of demon's total Health over 15 seconds.","Demon's critical hits from a spells or abilities have a 16% chance to generate 1% of your total total Mana over 15 seconds. In addition, your spell casts have a 4% chance to regenerate 1% of demon's total Health over 15 seconds.","Demon's critical hits from a spells or abilities have a 24% chance to generate 1% of your total total Mana over 15 seconds. In addition, your spell casts have a 6% chance to regenerate 1% of demon's total Health over 15 seconds.","Demon's critical hits from a spells or abilities have a 32% chance to generate 1% of your total total Mana over 15 seconds. In addition, your spell casts have a 8% chance to regenerate 1% of demon's total Health over 15 seconds.","Demon's critical hits from a spells or abilities have a 40% chance to generate 1% of your total total Mana over 15 seconds. In addition, your spell casts have a 10% chance to regenerate 1% of demon's total Health over 15 seconds."],"icon":"inv_helmet_08"},"Demonic Sacrifice":{"name":"Demonic Sacrifice","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Soul Link","cost":"","cooldown":"1 minute cooldown","descriptions":["When activated, sacrifices your summoned demon to grant you an effect based on demon's type.\n\nImp: Shifts you out of phase with the world for 10 seconds and reduces your threat caused by 31% for 5 minutes.\n\nVoidwalker: Shielding nearby group members, absorbing 1150 damage for 30 seconds and restores 2% of your total Health every 3 sec for 5 minutes.\n\nSuccubus: Increases attack and casting speed of nearby group members by 4% for 30 seconds and increases your damage by 4% for 5 minutes.\n\nFelhunter: Protects nearby group memebers from all spells for 3 seconds and restores 2% of your total Mana every 3 sec for 5 minutes."],"icon":"spell_shadow_psychicscream"}}}}