{"Restoration":{"name":"Restoration","background":"restoration","icon":"","talents":{"Nature's Guidance":{"name":"Nature's Guidance","pos":"a1","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases your chance to hit with melee attacks and spells by 1%.","Increases your chance to hit with melee attacks and spells by 2%.","Increases your chance to hit with melee attacks and spells by 3%."],"icon":"spell_frost_stun"},"Tidal Mastery":{"name":"Tidal Mastery","pos":"a2","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the critical effect chance of your healing and lightning spells by 1% and increases the speed reduction of your Frost Shock by an additional 2%.","Increases the critical effect chance of your healing and lightning spells by 2% and increases the speed reduction of your Frost Shock by an additional 4%.","Increases the critical effect chance of your healing and lightning spells by 3% and increases the speed reduction of your Frost Shock by an additional 6%.","Increases the critical effect chance of your healing and lightning spells by 4% and increases the speed reduction of your Frost Shock by an additional 8%.","Increases the critical effect chance of your healing and lightning spells by 5% and increases the speed reduction of your Frost Shock by an additional 10%."],"icon":"spell_nature_tranquility"},"Totemic Mastery":{"name":"Totemic Mastery","pos":"a3","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["The radius of your totems is increased by 10%.","The radius of your totems is increased by 20%."],"icon":"spell_nature_nullward"},"Improved Healing Wave":{"name":"Improved Healing Wave","pos":"b1","maxRank":5,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the cast time of your Healing Wave by 0.1 sec.","Reduces the cast time of your Healing Wave by 0.2 sec.","Reduces the cast time of your Healing Wave by 0.3 sec.","Reduces the cast time of your Healing Wave by 0.4 sec.","Reduces the cast time of your Healing Wave by 0.5 sec."],"icon":"spell_nature_magicimmunity"},"Totemic Focus":{"name":"Totemic Focus","pos":"b3","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the Mana cost of your totems by 25%.","Reduces the Mana cost of your totems by 50%."],"icon":"spell_nature_moonglow"},"Nature Grace":{"name":"Nature Grace","pos":"b4","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the threat you generate by 10%.","Reduces the threat you generate by 20%.","Reduces the threat you generate by 30%."],"icon":"spell_nature_healingtouch"},"Nature's Guardian":{"name":"Nature's Guardian","pos":"c1","maxRank":3,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Reduces the chance you are critically hit by 2%.","Reduces the chance you are critically hit by 4%.","Reduces the chance you are critically hit by 6%."],"icon":"spell_nature_natureguardian"},"Tidal Barrier":{"name":"Tidal Barrier","pos":"c2","maxRank":1,"reqPoints":10,"prereq":"Tidal Mastery","cost":"15% Base Mana","cooldown":"10 minutes cooldown","descriptions":["Reduces the damage taken from physical attacks and Fire spells by 50%, but reduces damage caused by 30%. Lasts 10 seconds."],"icon":"spell_frost_wisp"},"Spiritwalking":{"name":"Spiritwalking","pos":"c3","maxRank":2,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Reduces the chance you are hit by melee attacks by 2%. In addition, reduces the cooldown of your Astral Recall and Reincarnation spells by 15 min and increases the amount of health and mana you reincarnate with by an additional 15%.","Reduces the chance you are hit by melee attacks by 4%. In addition, reduces the cooldown of your Astral Recall and Reincarnation spells by 30 min and increases the amount of health and mana you reincarnate with by an additional 30%."],"icon":"spiritwalker"},"Nature Focus":{"name":"Nature Focus","pos":"c4","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Gives you a 14% chance to avoid interruption caused by damage while casting any healing spell and 6% while casting lightning damage spells.","Gives you a 28% chance to avoid interruption caused by damage while casting any healing spell and 12% while casting lightning damage spells.","Gives you a 42% chance to avoid interruption caused by damage while casting any healing spell and 18% while casting lightning damage spells.","Gives you a 56% chance to avoid interruption caused by damage while casting any healing spell and 24% while casting lightning damage spells.","Gives you a 70% chance to avoid interruption caused by damage while casting any healing spell and 30% while casting lightning damage spells."],"icon":"spell_nature_healingwavelesser"},"Nature Spirit":{"name":"Nature Spirit","pos":"d1","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases spell damage and healing by up to 8% of your total Spirit.","Increases spell damage and healing by up to 16% of your total Spirit.","Increases spell damage and healing by up to 24% of your total Spirit.","Increases spell damage and healing by up to 32% of your total Spirit.","Increases spell damage and healing by up to 40% of your total Spirit."],"icon":"spell_nature_preservation"},"Tidal Focus":{"name":"Tidal Focus","pos":"d2","maxRank":5,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Reduces the Mana cost of your healing and lightning spells by 1%. Also reduces the Mana cost of your Frost Shock spell by 10%.","Reduces the Mana cost of your healing and lightning spells by 2%. Also reduces the Mana cost of your Frost Shock spell by 20%.","Reduces the Mana cost of your healing and lightning spells by 3%. Also reduces the Mana cost of your Frost Shock spell by 30%.","Reduces the Mana cost of your healing and lightning spells by 4%. Also reduces the Mana cost of your Frost Shock spell by 40%.","Reduces the Mana cost of your healing and lightning spells by 5%. Also reduces the Mana cost of your Frost Shock spell by 50%."],"icon":"spell_frost_manarecharge"},"Restorative Totems":{"name":"Restorative Totems","pos":"d3","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases the effect of your Mana Tide, Mana Spring and Healing Stream Totems by 30%.","Increases the effect of your Mana Tide, Mana Spring and Healing Stream Totems by 50%."],"icon":"spell_nature_manaregentotem"},"Ancestral Healing":{"name":"Ancestral Healing","pos":"e1","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Increases your target's armor value by 5% for 20 seconds after getting a critical effect from one of your healing spells.","Increases your target's armor value by 10% for 20 seconds after getting a critical effect from one of your healing spells.","Increases your target's armor value by 15% for 20 seconds after getting a critical effect from one of your healing spells."],"icon":"spell_nature_undyingstrength"},"Purification":{"name":"Purification","pos":"e2","maxRank":5,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Increases the effectiveness of your healing spells by 2% and increases damage dealt to Undead or Demons by 3%.","Increases the effectiveness of your healing spells by 4% and increases damage dealt to Undead or Demons by 6%.","Increases the effectiveness of your healing spells by 6% and increases damage dealt to Undead or Demons by 9%.","Increases the effectiveness of your healing spells by 8% and increases damage dealt to Undead or Demons by 12%.","Increases the effectiveness of your healing spells by 10% and increases damage dealt to Undead or Demons by 15%."],"icon":"spell_frost_wizardmark"},"Nature's Swiftness":{"name":"Nature's Swiftness","pos":"e3","maxRank":1,"reqPoints":20,"cost":"","cooldown":"3 minutes cooldown","descriptions":["When activated, your next Nature spell with a casting time less than 10 sec. becomes an instant cast spell."],"icon":"spell_nature_ravenform"},"Focused Mind":{"name":"Focused Mind","pos":"e4","maxRank":3,"reqPoints":20,"prereq":"Nature Focus","cost":"","cooldown":"","descriptions":["Increases your chance to resist Silence and Interrupt effects by an additional 10%.","Increases your chance to resist Silence and Interrupt effects by an additional 20%.","Increases your chance to resist Silence and Interrupt effects by an additional 30%."],"icon":"spell_nature_focusedmind"},"Healing Way":{"name":"Healing Way","pos":"f1","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Your Healing Wave spells have a 20% chance to increase the effect of subsequent Healing Wave spells on that target by 2% for 20 seconds.  This effect will stack up to undefined times.","Your Healing Wave spells have a 40% chance to increase the effect of subsequent Healing Wave spells on that target by 2% for 20 seconds.  This effect will stack up to undefined times.","Your Healing Wave spells have a 60% chance to increase the effect of subsequent Healing Wave spells on that target by 2% for 20 seconds.  This effect will stack up to undefined times.","Your Healing Wave spells have a 80% chance to increase the effect of subsequent Healing Wave spells on that target by 2% for 20 seconds.  This effect will stack up to undefined times.","Your Healing Wave spells have a 100% chance to increase the effect of subsequent Healing Wave spells on that target by 2% for 20 seconds.  This effect will stack up to undefined times."],"icon":"spell_nature_healingway"},"Meditation":{"name":"Meditation","pos":"f3","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Allows 10% of your Mana regeneration to continue while casting.","Allows 20% of your Mana regeneration to continue while casting.","Allows 30% of your Mana regeneration to continue while casting.","Allows 40% of your Mana regeneration to continue while casting.","Allows 50% of your Mana regeneration to continue while casting."],"icon":"spell_nature_sleep"},"Cleansing Wave":{"name":"Cleansing Wave","pos":"g2","maxRank":1,"reqPoints":30,"prereq":"Purification","cost":"10% Base Mana","cooldown":"","descriptions":["Attempts to cure 1 poison, disease and magic effects, and additional 1 poison, disease and magic effects in 1 seconds."],"icon":"spell_shadow_demonbreath"}}}}