{"Subtlety":{"name":"Subtlety","background":"subtlety","icon":"","talents":{"Improved Sap":{"name":"Improved Sap","pos":"a1","maxRank":3,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Gives you a 30% chance to return to stealth mode after using your Sap ability. In addition, reduces the Energy cost of your Sap ability by 10.","Gives you a 60% chance to return to stealth mode after using your Sap ability. In addition, reduces the Energy cost of your Sap ability by 20.","Gives you a 90% chance to return to stealth mode after using your Sap ability. In addition, reduces the Energy cost of your Sap ability by 30."],"icon":"ability_sap"},"Master of Deception":{"name":"Master of Deception","pos":"a2","maxRank":2,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Reduces the chance enemies have to detect you while in Stealth mode.","Reduces the chance enemies have to detect you while in Stealth mode.  More effective than Master of Deception (Rank 1)."],"icon":"spell_shadow_charm"},"Opportunity":{"name":"Opportunity","pos":"a3","maxRank":5,"reqPoints":0,"cost":"","cooldown":"","descriptions":["Increases the damage dealt when striking from behind with your Backstab, Garrote, or Ambush abilities by 4%.","Increases the damage dealt when striking from behind with your Backstab, Garrote, or Ambush abilities by 8%.","Increases the damage dealt when striking from behind with your Backstab, Garrote, or Ambush abilities by 12%.","Increases the damage dealt when striking from behind with your Backstab, Garrote, or Ambush abilities by 16%.","Increases the damage dealt when striking from behind with your Backstab, Garrote, or Ambush abilities by 20%."],"icon":"ability_warrior_warcry"},"Initiative":{"name":"Initiative","pos":"b1","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Gives you a 30% chance to add an additional combo point to your target when using your Ambush, Garrote, or Cheap Shot ability.","Gives you a 60% chance to add an additional combo point to your target when using your Ambush, Garrote, or Cheap Shot ability.","Gives you a 90% chance to add an additional combo point to your target when using your Ambush, Garrote, or Cheap Shot ability."],"icon":"spell_shadow_fumble"},"Sleight of Hand":{"name":"Sleight of Hand","pos":"b2","maxRank":3,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the chance you are critically hit by melee and ranged attacks by 2% and increases the threat reduction of your Feint ability by 30%.","Reduces the chance you are critically hit by melee and ranged attacks by 4% and increases the threat reduction of your Feint ability by 60%.","Reduces the chance you are critically hit by melee and ranged attacks by 6% and increases the threat reduction of your Feint ability by 90%."],"icon":"ability_rogue_feint"},"Thug Life":{"name":"Thug Life","pos":"b4","maxRank":2,"reqPoints":5,"cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Distract and Disarm Trap by 10 sec and reduces cost of your Distract by 50%.\nAlso increases the amount of money you gain from pickpocketing by 20% and reputation gains by 5%.","Reduces the cooldown of your Distract and Disarm Trap by 20 sec and reduces cost of your Distract by 100%.\nAlso increases the amount of money you gain from pickpocketing by 40% and reputation gains by 10%."],"icon":"inv_misc_bandana_03"},"Setup":{"name":"Setup","pos":"c1","maxRank":3,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Gives you a 301% chance to add a combo point to your target after dodging an attack or fully resisting a spell.","Gives you a 601% chance to add a combo point to your target after dodging an attack or fully resisting a spell.","Gives you a 901% chance to add a combo point to your target after dodging an attack or fully resisting a spell."],"icon":"spell_nature_mirrorimage"},"Connivery":{"name":"Connivery","pos":"c4","maxRank":5,"reqPoints":10,"cost":"","cooldown":"","descriptions":["All attacks from behind deal 2% more damage. ","All attacks from behind deal 4% more damage. ","All attacks from behind deal 6% more damage. ","All attacks from behind deal 8% more damage. ","All attacks from behind deal 10% more damage. "],"icon":"cloak_of_flame"},"Improved Ambush":{"name":"Improved Ambush","pos":"c3","maxRank":3,"reqPoints":10,"prereq":"Opportunity","cost":"","cooldown":"","descriptions":["Increases the critical strike chance of your Ambush ability by 15%, and reduces the threat caused by it by 33%.","Increases the critical strike chance of your Ambush ability by 30%, and reduces the threat caused by it by 66%.","Increases the critical strike chance of your Ambush ability by 45%, and reduces the threat caused by it by 99%."],"icon":"ability_rogue_ambush"},"Camouflage":{"name":"Camouflage","pos":"c2","maxRank":1,"reqPoints":10,"cost":"","cooldown":"","descriptions":["Increases your speed while stealthed by 15% and reduces the cooldown of your Stealth ability by 5 sec."],"icon":"ability_stealth"},"Heightened Senses":{"name":"Heightened Senses","pos":"d1","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Increases your Stealth detection and reduces the chance you are hit by spells and ranged attacks by 3%.","Increases your Stealth detection and reduces the chance you are hit by spells and ranged attacks by 6%.  More effective than Heightened Senses (Rank 1)."],"icon":"ability_ambush"},"Elusiveness":{"name":"Elusiveness","pos":"d2","maxRank":2,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Reduces the cooldown of your Evasion and Vanish by 1 min and increases your Dodge chance by 3%.","Reduces the cooldown of your Evasion and Vanish by 2 min and increases your Dodge chance by 5%."],"icon":"spell_magic_lesserinvisibilty"},"Serrated Blades":{"name":"Serrated Blades","pos":"d3","maxRank":3,"reqPoints":15,"cost":"","cooldown":"","descriptions":["Causes your attacks to ignore up to 100 of your target's Armor and increases the damage of your Garrote and Rupture abilities by 10%.  The amount of Armor reduced increases with your level.","Causes your attacks to ignore up to 200 of your target's Armor and increases the damage of your Garrote and Rupture abilities by 20%.  The amount of Armor reduced increases with your level.","Causes your attacks to ignore up to 300 of your target's Armor and increases the damage of your Garrote and Rupture abilities by 30%.  The amount of Armor reduced increases with your level."],"icon":"inv_sword_17"},"Cloak of Shadows":{"name":"Cloak of Shadows","pos":"e2","maxRank":1,"reqPoints":20,"cost":"","cooldown":"2 minutes cooldown","descriptions":["Protects the rogue from all spells for 5 seconds.  Does not break stealth."],"icon":"spell_shadow_nethercloak"},"Dirty Deeds":{"name":"Dirty Deeds","pos":"e3","maxRank":3,"reqPoints":20,"cost":"","cooldown":"","descriptions":["Reduces the Energy cost of your Ambush, Cheap Shot and Garrote abilities by 10.\n\nIn addition, adds your Ambush and Backstab abilities a 30% chance to apply your current rank of Hemorrhage debuff.","Reduces the Energy cost of your Ambush, Cheap Shot and Garrote abilities by 20.\n\nIn addition, adds your Ambush and Backstab abilities a 60% chance to apply your current rank of Hemorrhage debuff.","Reduces the Energy cost of your Ambush, Cheap Shot and Garrote abilities by 30.\n\nIn addition, adds your Ambush and Backstab abilities a 90% chance to apply your current rank of Hemorrhage debuff."],"icon":"spell_shadow_summonsuccubus"},"Hemorrhage":{"name":"Hemorrhage","pos":"e4","maxRank":1,"reqPoints":20,"prereq":"Serrated Blades","cost":"35 Mana","cooldown":"","descriptions":["An instant strike that damages the opponent and causes the target to hemorrhage, increasing any Physical damage dealt to the target by up to 7.  Lasts 15 seconds.  Awards 1 combo point."],"icon":"spell_shadow_lifedrain"},"Brigandage":{"name":"Brigandage","pos":"f1","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Your auto attacks have a 20% chance to deal .5 per level Shadow damage and to drain x3 ammount of Mana, 5 Energy or 3 Rage.","Your auto attacks have a 40% chance to deal .5 per level Shadow damage and to drain x3 ammount of Mana, 5 Energy or 3 Rage.","Your auto attacks have a 60% chance to deal .5 per level Shadow damage and to drain x3 ammount of Mana, 5 Energy or 3 Rage.","Your auto attacks have a 80% chance to deal .5 per level Shadow damage and to drain x3 ammount of Mana, 5 Energy or 3 Rage.","Your auto attacks have a 100% chance to deal .5 per level Shadow damage and to drain x3 ammount of Mana, 5 Energy or 3 Rage."],"icon":"inv_sword_11"},"Deadliness":{"name":"Deadliness","pos":"f3","maxRank":5,"reqPoints":25,"cost":"","cooldown":"","descriptions":["Increases your Attack Power by 3%.","Increases your Attack Power by 6%.","Increases your Attack Power by 9%.","Increases your Attack Power by 12%.","Increases your Attack Power by 15%."],"icon":"inv_weapon_crossbow_11"},"Enveloping Shadows":{"name":"Enveloping Shadows","pos":"g2","maxRank":3,"reqPoints":30,"prereq":"Cloak of Shadows","cost":"","cooldown":"","descriptions":["Increases your chance to avoid area of effect spells by an additional 15%. While stealthed the effect is doubled.","Increases your chance to avoid area of effect spells by an additional 30%. While stealthed the effect is doubled.","Increases your chance to avoid area of effect spells by an additional 45%. While stealthed the effect is doubled."],"icon":"ability_rogue_envelopingshadows"},"Preparation":{"name":"Preparation","pos":"g3","maxRank":1,"reqPoints":30,"cost":"","cooldown":"5 minutes cooldown","descriptions":["When activated, this ability immediately finishes the cooldown on your other Rogue abilities."],"icon":"spell_shadow_antishadow"}}}}